let message = {
  // דף הבית
  HomePage: {
    home: "דף הבית",
    version: "גרסה בסיסית (חינם):",
    times: "העתקה חינמית {times} פעמים ביום, נותרו לך {left} פעמים להעתקה.",
    tips: "שדרגו ל-Pro לתמלולים בלתי מוגבלים.",
    update: "שדרג עכשיו",
    folders: "תיקיות",
    rename: "שנה שם",
    delete: "מחק",
    createTitle: "צור תיקייה",
    deleteConfirm: "האם אתה בטוח שברצונך למחוק את התיקייה וכל הקבצים שבה?",
    cancel: "ביטול",
    confirm: "צור",
    dialogLabel: "שם תיקייה",
    recently: "קבצים אחרונים",
    tour: {
      step0: {
        title: "ברוכים הבאים ל{name}",
        tip: "כאן, אתה יכול:",
        content: "להעתיק שיחות חד פעמיות, פגישות, הרצאות ועוד",
        next: "התחל להשתמש"
      },
      step1: {
        title: "העתק קבצים",
        content: "תומך בשלוש שיטות העתקה: קבצים מקומיים, קישורים והקלטות."
      },
      step2: {
        title: "צור תיקיות",
        content: 'לחץ על "+" כדי ליצור תיקיות ולארגן את הקבצים שלך.'
      },
      step3: {
        title: "צפה בפרטי ההעתקה וערוך",
        content: "לחץ על פריט כדי לראות פרטי העתקה ולערוך, אתה יכול גם לתרגם."
      },
      next: "הבא",
      finish: "הבנתי"
    },
    export: {
      export: "ייצוא",
      title: "אנו מייצרים את קובץ הייצוא שלך",
      title2: "הקובץ שלך מוכן",
      singleLoadingContent: "דוחס קובץ 1.",
      singleSuccessContent: "קובץ 1 נדחס.",
      loadingContent: "דוחס {num} קבצים.",
      successContent: "{num} קבצים נדחסו.",
      cancel: "בטל ייצוא",
      error: "שגיאת ייצוא",
      dialog: {
        title: "אזהרה",
        content: "לבטל ייצוא?",
        cancel: "בטל ייצוא",
        continue: "המשך ייצוא"
      }
    },
    welcome: {
      title: "ברוכים הבאים ל-Scribify!",
      description: "כאן, תוכלו:",
      transcribe:
        "לתמלל בקלות עם Scribify—להפוך שיחות קוליות לטקסט ברור, חיפושי וניתן לשיתוף ברגע.",
      precision:
        "לקבל תמלולים מדויקים עם זיהוי דוברים וחותמות זמן באופן מיידי.",
      translate: "לשבור מחסומי שפה: לתרגם תמלילים ליותר מ-200 שפות בקלות.",
      edit: "לערוך, לשפר ולייצא את התמלילים שלכם בפורמטים המתאימים לצרכים שלכם.",
      collaborate: "לשתף פעולה על ידי שיתוף הטקסט המתומלל שלכם עם אחרים.",
      button: "להתחיל",
      tip: "מוכנים להפוך אודיו לטקסט מתומלל? התחילו לחקור עכשיו!"
    },
    subscriptionModal: {
      left: {
        title: "קבלו את תוכנית Pro כדי לפתוח יותר אפשרויות",
        c1: "תמלולים בלתי מוגבלים",
        c2: "העלאות של 10 שעות",
        c3: "עדיפות עליונה",
        c4: "דיוק תמלול של 99%",
        c5: "תמיכה ביותר מ-100 שפות",
        c6: "זיהוי דוברים",
        c7: "תרגום תמלילים",
        t1: "תמלולים בלתי מוגבלים לאדם אחד.",
        t2: "כל קובץ יכול להיות עד 10 שעות / 5 ג'יגה-בייט. העלו 50 קבצים בבת אחת.",
        t3: "אנו תמיד נתמלל את הקבצים שלכם בהקדם האפשרי עם העדיפות הגבוהה ביותר."
      },
      right: {
        title: "קבלו את תוכנית Pro",
        yearly: "שנתי",
        monthly: "חודשי",
        save: "חיסכון",
        preMonth: "לחודש",
        preYear: "לשנה",
        firstMonth: "חודש ראשון",
        afterwards: "לאחר מכן"
      },
      subscribe: "הירשמו"
    }
  },
  // דף תיקייה
  FolderPage: {
    table: {
      name: "שם",
      duration: "משך",
      status: "סטטוס",
      date: "תאריך יצירה",
      activity: "פעילות",
      empty1: "ריק כאן.",
      empty2: "לחץ על הכפתור למעלה להעתיק קבצים.",
      just: "כרגע",
      export: "ייצוא",
      delete: "מחק",
      share: "שתף",
      rename: "שנה שם",
      move: "העבר",
      failed: "נכשל",
      selected: "נבחר",
      success: "הצלחה"
    },
    dialog: {
      move: {
        title: "העבר",
        label: "בחר תיקייה",
        placeholder: "בחר תיקייה",
        confirm: "העבר",
        cancel: "ביטול"
      },
      rename: {
        title: "שנה שם",
        label: "שם קובץ",
        confirm: "שנה שם",
        cancel: "ביטול"
      },
      delete: {
        title: "מחק",
        file: "קובץ",
        files: "קבצים",
        label: "אשר מחיקה? פעולה זו אינה הפיכה.",
        confirm: "מחק",
        cancel: "ביטול"
      },
      share: {
        title: "שתף",
        label:
          "כל מי שיש לו את הקישור הבטוח הבא יוכל לצפות בהעתקה ובקבצי המדיה הקשורים.",
        confirm: "העתק קישור",
        success: "הועתק בהצלחה"
      },
      export: {
        title: "ייצוא",
        select: "בחר פורמט אחד או יותר",
        settings: "הגדרות",
        speaker: "כלול דובר",
        timecodes: "כלול קודי זמן",
        confirm: "ייצוא",
        cancel: "ביטול",
        selectErr: "אנא בחר פורמט אחד או יותר"
      }
    },
    search: {
      placeholder: "חיפוש"
    },
    recently: "לאחרונה",
    record: "הקלטה",
    transcribe: "העתק",
    unclassified: "תיקייה לא מסווגת",
    buttons: {
      transcribe: "העתק קובץ",
      url: "העתק קישור",
      record: "הקלט והעתק",
      recording: "מקליט..."
    },
    delSuccess: "נמחק בהצלחה",
    create: "צור"
  },
  // העלאת קבצים והקלטה
  FileUploadAndRecording: {
    record: {
      record: "הקלט",
      pause: "השהה",
      resume: "המשך",
      stop: "עצור",
      delete: "מחק",
      transcribe: "העתק",
      permissionDenied: "הרשאת מיקרופון נדחתה או המכשיר לא קיים",
      dialog: {
        delete: {
          title: "אזהרה",
          label: "האם אתה בטוח שברצונך למחוק הקלטה זו?",
          confirm: "מחק",
          cancel: "ביטול"
        },
        complete: {
          title: "הקלטה הושלמה",
          label: "ההקלטה הגיעה ל-10 שעות ונעצרה אוטומטית. אנא המשך להעתקה.",
          confirm: "הבנתי"
        }
      }
    },
    upload: {
      link: {
        dialogTitle: "העתק מדיה מקוונת",
        title: "הדבק קישור",
        label:
          "הדבק קישורי מדיה מהפלטפורמות הבאות ועוד: יוטיוב, פייסבוק, X, דרופבוקס, גוגל דרייב, וימאו",
        confirm: "העתק",
        cancel: "ביטול",
        errorTitle: "כתובת הקישור שהזנת אינה נכונה. אנא בדוק ונסה שוב.",
        linkName: "קישור"
      },
      file: {
        orTitle: "העתק מדיה מקוונת",
        dialogTitle: "העתק קובץ",
        tip: "לחץ להעלאה או גרור ושחרר",
        or: "או"
      },
      del: {
        title: "אזהרה",
        content: "כל ההתקדמות תאבד. לאשר ביטול העתקה?",
        cancel: "אשר ביטול",
        confirm: "המשך העתקה"
      },
      files: "קבצים",
      resultDialogTitle: "העתק קבצים",
      cancel: "ביטול",
      confirm: "העתק",
      return: "חזור",
      addMore: "הוסף עוד",
      language: "שפת אודיו",
      failed: "נכשל",
      tooLarge: "הקובץ גדול מדי.",
      fileFormat: "פורמט הקובץ אינו מורשה",
      localFiles: "קבצים מקומיים",
      pasteLink: "הדבק קישור",
      uploadErr: "שגיאת העלאה",
      hashErr: "שגיאת גיבוב",
      table: {
        status: "סטטוס",
        file: "קובץ",
        size: "גודל",
        noData: "אין נתונים"
      },
      maxFileNum: "מספר הקבצים לא יכול לעלות על {num}.",
      speaker: "זיהוי דובר",
      speakerLabel: "מתייג כל קטע בתמלול עם הדובר המתאים."
    }
  },
  // דף פרטי העתקה
  TranscriptionPage: {
    edit: "ערוך",
    translate: "תרגם",
    showSpeaker: "הצג דובר",
    showTimestamp: "הצג חותמת זמן",
    share: "שתף",
    shared: "משותף",
    export: "ייצוא",
    speaker: "דובר_{id}",
    unassignSpeaker: "בטל הקצאת דובר",
    play: "נגן",
    save: "שמור",
    undo: "בטל",
    redo: "בצע שוב",
    confirm: "אשר",
    cancel: "ביטול",
    addNew: "הוסף חדש",
    createANewSpeaker: "צור דובר חדש",
    speakerName: "שם דובר",
    addSpeaker: "הוסף דובר",
    applyToAllMatchingSpeakers: "החל על כל הדוברים התואמים",
    cancelTranslation: "בטל תרגום",
    showVideo: "הצג וידאו",
    hideVideo: "הסתר וידאו",
    langChooseV1: {
      recently: "לאחרונה",
      popular: "פופולרי",
      other: "אחר",
      searchLanguage: "חפש שפה",
      noMatch: "לא נמצאה שפה תואמת",
      English: "אנגלית",
      "English(US)": 'אנגלית (ארה"ב)',
      "English(UK)": "אנגלית (בריטניה)",
      Spanish: "ספרדית",
      Portuguese: "פורטוגזית",
      French: "צרפתית",
      Italian: "איטלקית",
      German: "גרמנית",
      Dutch: "הולנדית",
      Polish: "פולנית",
      Danish: "דנית",
      Japanese: "יפנית",
      Korean: "קוריאנית",
      Hungarian: "הונגרית",
      Czech: "צ'כית",
      Chinese: "סינית",
      Hebrew: "עברית",
      Arabic: "ערבית",
      Azerbaijani: "אזרבייג'נית",
      Estonian: "אסטונית",
      Belarusian: "בלארוסית",
      Bulgarian: "בולגרית",
      Icelandic: "איסלנדית",
      Bosnian: "בוסנית",
      Persian: "פרסית",
      Russian: "רוסית",
      "Chinese(Traditional)": "סינית (מסורתית)",
      Finnish: "פינית",
      Kazakh: "קזחית",
      Galician: "גליסית",
      Catalan: "קטלאנית",
      "Chinese(Simplified)": "סינית (מפושטת)",
      Kannada: "קנאדה",
      Croatian: "קרואטית",
      Latvian: "לטבית",
      Lithuanian: "ליטאית",
      Romanian: "רומנית",
      Marathi: "מראטהי",
      Malay: "מלאית",
      Macedonian: "מקדונית",
      Maori: "מאורית",
      Afrikaans: "אפריקאנס",
      Nepali: "נפאלית",
      Norwegian: "נורווגית",
      Swedish: "שוודית",
      Serbian: "סרבית",
      Slovak: "סלובקית",
      Slovenian: "סלובנית",
      Swahili: "סווהילית",
      Tagalog: "טגלוג",
      Tamil: "טמילית",
      Thai: "תאית",
      Turkish: "טורקית",
      Welsh: "וולשית",
      Urdu: "אורדו",
      Ukrainian: "אוקראינית",
      Greek: "יוונית",
      Armenian: "ארמנית",
      Hindi: "הינדית",
      Indonesian: "אינדונזית",
      Vietnamese: "וייטנאמית",
      Albanian: "אלבנית",
      Amharic: "אמהרית",
      Assamese: "אסאמית",
      Occitan: "אוקסיטנית",
      Bashkir: "בשקירית",
      Basque: "באסקית",
      Breton: "ברטונית",
      Tibetan: "טיבטית",
      Faroese: "פארואזית",
      Sanskrit: "סנסקריט",
      Khmer: "חמרית",
      Georgian: "גאורגית",
      Gujarati: "גוג'ראטית",
      "Haitian Creole": "קריאולית האיטית",
      Hausa: "האוסה",
      Latin: "לטינית",
      Lao: "לאית",
      Lingala: "לינגלה",
      Luxembourgish: "לוקסמבורגית",
      Malagasy: "מלגשית",
      Maltese: "מלטזית",
      Malayalam: "מלאיאלם",
      Mongolian: "מונגולית",
      Bengali: "בנגלית",
      Burmese: "בורמזית",
      Punjabi: "פנג'אבית",
      Pashto: "פשטו",
      Sinhala: "סינהלית",
      Shona: "שונה",
      Somali: "סומלית",
      Tajik: "טג'יקית",
      Tatar: "טטרית",
      Telugu: "טלוגו",
      Turkmen: "טורקמנית",
      Uzbek: "אוזבקית",
      Hawaiian: "הוואית",
      "Norwegian Nynorsk": "נורווגית ניאנורסק",
      Sindhi: "סינדהית",
      Sundanese: "סונדנזית",
      Yiddish: "יידיש",
      Yoruba: "יורובה",
      Javanese: "ג'אווה",
      Cantonese: "קנטונזית",
      Abkhaz: "אבחזית",
      Afar: "אפרית",
      alz: "אלורית",
      ach: "אצ'ולית",
      awa: "אוואדהית",
      Avaric: "אווארית",
      Ewe: "אווה",
      Aymara: "איימרה",
      Irish: "אירית",
      Oriya: "אוריה",
      Oromo: "אורומו",
      Ossetian: "אוסטית",
      tpi: "טוק פיסין",
      bew: "בטאווי",
      ban: "באלינזית",
      btx: "באטק קארו",
      bbc: "באטק טובה",
      bts: "באטק סימלונגון",
      bci: "באולה",
      Bambara: "במבארה",
      pag: "פנגסינן",
      pam: "פמפנגה",
      nso: "סוטו צפונית",
      bem: "במבה",
      bik: "ביקול",
      bal: "בלוצ'י",
      bho: "בהוג'פורי",
      bua: "בוריאטית",
      chm: "מארי",
      Chamorro: "צ'מורו",
      Chechen: "צ'צ'נית",
      chk: "צ'וקסה",
      Chuvash: "צ'ובשית",
      Tswana: "טסוואנה",
      Tsonga: "טסונגה",
      "fa-AF": "דארי",
      shn: "שאן",
      tet: "טטום",
      Divehi: "דיבהי",
      dyu: "דיולה",
      tiv: "טיב",
      din: "דינקה",
      doi: "דוגרי",
      "ndc-ZW": "נדאו",
      "South Ndebele": "נדבלה דרומית",
      dov: "דומבה",
      "bm-Nkoo": "נקו",
      "French(Canada)": "צרפתית (קנדה)",
      Fijian: "פיג'ית",
      fon: "פון",
      "Western Frisian": "פריזית",
      fur: "פריולית",
      Fulah: "פולה",
      Kongo: "קונגו",
      Kalaallisut: "גרינלנדית",
      gom: "קונקאני גואן",
      Guarani: "גוארני",
      cnh: "האקה צ'ין",
      hrx: "הונסריקיש",
      Kyrgyz: "קירגיזית",
      ktu: "קיטובה",
      gaa: "גא",
      kac: "קאצ'ין",
      Kanuri: "קנורי",
      kha: "חאסי",
      kek: "קקצ'י",
      Komi: "קומי",
      Xhosa: "קוסה",
      Corsican: "קורסיקנית",
      "crh-Latn": "קרימצ'אק (לטינית)",
      crh: "קרימצ'אק (קירילית)",
      Quechua: "קצ'ואה",
      Kurdish: "כורדית (כורמנג'י)",
      ckb: "כורדית (סורני)",
      trp: "קוק בורורוק",
      ltg: "לטגאלית",
      lij: "ליגורית",
      Limburgish: "לימבורגית",
      Kirundi: "קירונדי",
      luo: "לואו",
      Luganda: "לוגנדה",
      Kinyarwanda: "קיניארואנדה",
      lmo: "לומברדית",
      rom: "רומני",
      mad: "מדורזית",
      Manx: "מאנית",
      mwr: "מרווארי",
      "ms-Arab": "מלאית (ג'אווי)",
      Marshallese: "מרשלית",
      mam: "מאם",
      mai: "מאיטילי",
      mfe: "מאוריציוס קריאולית",
      "mni-Mtei": "מיטיי",
      min: "מיננגקאבאו",
      lus: "מיזו",
      hmn: "המונג",
      nhe: "נאהואטל (מזרחית)",
      "Southern Sotho": "סוטו דרומית",
      new: "נווארי",
      nus: "נואר",
      pap: "פפיאמנטו",
      "pa-Arab": "פנג'אבית (שאהמוקי)",
      "pt-PT": "פורטוגזית (פורטוגל)",
      Chichewa: "צ'יצ'ווה",
      cgg: "צ'יגה",
      lua: "לובה-לולואה",
      Akan: "אקאן",
      zap: "זאפוטק",
      "Northern Sami": "סאמי צפונית",
      Samoan: "סמואית",
      kri: "קריו סיירה לאון",
      crs: "סיישל קריאול",
      Sango: "סנגו",
      "sat-Latn": "סנטלי (לטינית)",
      sat: "סנטלי (אול צ'יקי)",
      Esperanto: "אספרנטו",
      Swati: "סוואטי",
      "Scottish Gaelic": "גאלית סקוטית",
      sus: "סוסו",
      ceb: "סבואנו",
      ber: "ברברית (תיפינאג)",
      "ber-Latn": "ברברית (לטינית)",
      Tahitian: "טהיטית",
      Tonga: "טונגה",
      Tigrinya: "תיגרינית",
      tcy: "טולו",
      tum: "טומבוקה",
      tyv: "טובינית",
      war: "וארי",
      mak: "מקסר",
      vec: "ונציאנית",
      Uyghur: "אויגורית",
      Venda: "ונדה",
      Wolof: "וולוף",
      udm: "אודמורטית",
      szl: "שלזית",
      scn: "סיציליאנית",
      hil: "היליגיינון",
      jam: "פטואה ג'מייקני",
      sah: "יקוטית",
      ace: "אצ'ינזית",
      iba: "איבן",
      Igbo: "איגבו",
      ilo: "אילוקנו",
      "iu-Latn": "אינוקטיטוט (לטינית)",
      Inuktitut: "אינוקטיטוט",
      yua: "יוקטק מאיה",
      Dzongkha: "דזונגקה",
      Zulu: "זולו"
    },
    notFund: "לא נמצא",
    notFundDesc: "לא הצלחנו למצוא את מה שחיפשת.",
    shareTips:
      "כל מי שיש לו את הקישור הבטוח הבא יוכל לצפות בתמליל זה וקבצי המדיה הקשורים.",
    copyLink: "העתק קישור",
    copySuccessful: "הועתק בהצלחה",
    copyFail: "העתקה נכשלה",
    closeTrans: "בטל תרגום",
    upgradeBtn: "שדרג עכשיו",
    upgradeTip30: "קובץ זה עולה על 30 דקות.",
    upgradeTipMore: "שדרג ל-Scribify Pro לתמלול קבצים עד 10 שעות"
  },
  // התחברות, הרשמה, איפוס סיסמה
  IdentityInfoManage: {
    or: "או",
    signup: "הרשמה",
    sign_up: "הרשמה",
    loginByGoogle: "התחבר עם גוגל",
    emailAddress: "הזן את האימייל שלך",
    createAccount: "צור חשבון",
    accountExists: "כבר יש לך חשבון? ",
    agreeTerm: {
      agree: "אני מסכים ל{proName}{terms} ו{policy}.",
      terms: "תנאי השירות",
      policy: "מדיניות פרטיות"
    },
    setPassword: "הגדר סיסמה",
    code: "קוד אימות",
    resend: "שלח שוב",
    codeToEmail:
      "שלחנו קוד אימות לאימייל שלך. בדוק את תיבת הדואר והדבק את הקוד למעלה.",
    enterPassword: "הזן סיסמה.",
    passwordLeval: "חוזק סיסמה",
    Weak: "חלשה",
    Medium: "בינונית",
    Strong: "חזקה",
    confirmPassword: "אשר סיסמה",
    invalidEmail: "כתובת אימייל לא חוקית",
    logInDirectly: "החשבון כבר קיים, התחבר ישירות.",
    codeErrorTryAgain: "קוד אימות שגוי, נסה שוב.",
    atLeastSix: "הסיסמה חייבת להיות לפחות 6 תווים.",
    passwordNotMatch: "הסיסמאות אינן תואמות, נסה שוב.",
    login: "התחברות",
    log_in: "התחברות",
    log_In: "התחברות",
    password: "סיסמה",
    forgotPassword: "שכחת סיסמה?",
    noAccount: "אין לך חשבון?",
    accountNotExists: "החשבון אינו קיים.",
    passwordError: "סיסמה שגויה",
    sendCode: "שלח קוד",
    resetPassword: "אפס סיסמה",
    resetYourPassword: "אפס את הסיסמה שלך",
    newOldCantSame: "הסיסמה החדשה לא יכולה להיות זהה לישנה.",
    passwordResetOk: "איפוס הסיסמה הצליח!"
  },
  // דף שיתוף
  Sharepage: {},
  // דף אתחול
  InitPage: {},
  // הגדרות חשבון
  AccountSettingsPage: {
    subscription: "תוכנית מנוי",
    freeversion: "חינם",
    transcribeTimesDay: "3 תמלולים יומיים",
    freeThreeTimesDay: "תמלל 3 קבצים בחינם כל יום.",
    uploadMinutes: "העלאות של 30 דקות",
    oneFileUploaded:
      "כל קובץ יכול להיות באורך של עד 30 דקות, עם קובץ אחד מועלה בכל פעם",
    lowerPriority: "עדיפות נמוכה",
    needsToWaitLonger:
      "3 תמלולים יומיים חכה זמן רב יותר עד שהקבצים שלך יתומללו.",
    currentPlan: "תוכנית נוכחית",
    professionalEdition: "גרסה מקצועית",
    unlimitedTranscription: "תמלול בלתי מוגבל",
    unlimitedNumberOfTimes: "תמלולים בלתי מוגבלים עבור אדם אחד.",
    uploadWithinHours: "העלאה עד 10 שעות",
    filesUploadedAtOnce:
      "כל קובץ יכול להיות באורך של עד 10 שעות / 5 GB. העלה 50 קבצים בבת אחת.",
    highestPriority: "עדיפות גבוהה ביותר",
    weWillGiveTheHighest:
      "אנו תמיד נתמלל את הקבצים שלך בהקדם האפשרי עם העדיפות הגבוהה ביותר.",
    theFirstMonth: "החודש הראשון",
    subscribeTo: "להירשם ל",
    basicVersionFree: "גרסה בסיסית (חינם)",
    return: "חזרה",
    annualize: "שנתי",
    monthly: "חודשי",
    everyYear: "כל שנה",
    saved: "נשמר",
    byTheMonth: "לחודש",
    firstMonth: "חודש ראשון",
    afterwardsEveryMonth: "לאחר מכן, כל חודש",
    manageSubscription: "נהל מנוי",
    professionalYearbook: "מקצועי שנתי",
    professionalMonthly: "מקצועי חודשי",
    subscriptionWillCancelledOn: "המנוי שלך יבוטל ב-",
    displayLanguage: "שפת תצוגה",
    update: "שדרג עכשיו",
    basicversion: "גרסה בסיסית (חינם)",
    daily: "{start} מתוך {end} תמלולים יומיים בשימוש",
    upgradetoPro: "שדרג ל-Pro",
    accountSetting: "הגדרות חשבון",
    returnAccountSetting: "חזור להגדרות חשבון",
    logOut: "התנתק",
    account: "חשבון",
    email: "אימייל",
    id: "מזהה",
    password: "סיסמה",
    resetPassword: "אפס סיסמה",
    logIn: "התחבר",
    tryForFree: "נסה בחינם",
    notFund: "לא נמצא",
    couldntFind: "לא מצאנו את מה שחיפשת.",
    proAnnual: "Pro שנתי",
    yourSubscription: "המנוי שלך יבוטל ב",
    proMonthly: "Pro חודשי",
    perMonth: "לחודש",
    afterwards: "לאחר מכן",
    accuracy: "דיוק תמלול",
    supported: "שפות נתמכות",
    identification: "זיהוי דובר",
    transcriptSranslation: "תרגום תמלול",
    perYear: "לשנה",
    getProPlan: "קבל תוכנית Pro",
    changeToAnnual: "שנה לשנתי",
    automaticRenewalon: "חידוש אוטומטי ב"
  },
  // מיפוי שפות
  LanguageMap: {
    sysLanguagesMap: {
      "Chinese(Simplified)": "סינית (מפושטת)",
      "Chinese(Traditional)": "סינית (מסורתית)",
      Japanese: "יפנית",
      Danish: "דנית",
      German: "גרמנית",
      English: "אנגלית",
      Spanish: "ספרדית",
      French: "צרפתית",
      Italian: "איטלקית",
      Hungarian: "הונגרית",
      Dutch: "הולנדית",
      Norwegian: "נורווגית",
      Polish: "פולנית",
      Portuguese: "פורטוגזית",
      Finnish: "פינית",
      Swedish: "שוודית",
      Turkish: "טורקית",
      Greek: "יוונית",
      Russian: "רוסית",
      Ukrainian: "אוקראינית",
      Hebrew: "עברית",
      Arabic: "ערבית",
      Korean: "קוריאנית"
    }
  },
  demo: {
    title: "NuxtPro",
    description:
      "תבנית Nuxt3 SaaS בקוד פתוח עם אינטגרציה מוכנה לשערי תשלום גלובליים (Stripe/Cream), Google OAuth, ניתוב i18n וכלי SEO. מיועד למפתחים היוצרים אפליקציות רב-לשוניות, עם תמיכה ב-SSR/SSG ואבטחה ברמת ייצור.",
    startLink: "התחל ניסיון חינם~",
    thirdPartyLink: "Github →",
    waitlist: {
      cardTitle: "הצטרף לרשימת ההמתנה לקבלת חדשות והנחות NuxtPro ראשונים!",
      placeholder: "הזן את האימייל שלך",
      button: "הצטרף לרשימת ההמתנה",
      joinCountMessage: "🔥 משתמש מוקדם #{count} הצטרף זה עתה לרשימת ההמתנה!"
    },
    seo: {
      title: "תבנית Nuxt SaaS בקוד פתוח | NuxtPro",
      description:
        "תבנית NuxtJS עם כל מה שאתה צריך להציג את המוצר שלך ללקוחות במהירות. מרעיון לייצור תוך 5 דקות."
    },
    api: {
      title: "זוהי הדגמה",
      corpInfo: "מידע על החברה"
    }
  },
  videoLang: {
    ERROR_TYPES: {
      network: {
        code: 1,
        msg: "שגיאת הורדת וידאו"
      },
      mse: {
        code: 2,
        msg: "שגיאת הוספת זרם"
      },
      parse: {
        code: 3,
        msg: "שגיאת ניתוח"
      },
      format: {
        code: 4,
        msg: "שגיאת פורמט"
      },
      decoder: {
        code: 5,
        msg: "שגיאת פענוח"
      },
      runtime: {
        code: 6,
        msg: "שגיאת תחביר"
      },
      timeout: {
        code: 7,
        msg: "פסק זמן בניגון"
      },
      other: {
        code: 8,
        msg: "שגיאה אחרת"
      }
    },
    HAVE_NOTHING: "אין מידע האם האודיו/וידאו מוכן",
    HAVE_METADATA: "המטא-דאטה של האודיו/וידאו מוכן",
    HAVE_CURRENT_DATA:
      "נתונים על המיקום הנוכחי זמינים, אך אין מספיק נתונים לנגן את הפריים/מילישנייה הבא",
    HAVE_FUTURE_DATA: "נתונים של המיקום הנוכחי ולפחות הפריים הבא זמינים",
    HAVE_ENOUGH_DATA: "יש מספיק נתונים להתחיל בניגון",
    NETWORK_EMPTY: "האודיו/וידאו עדיין לא אותחל",
    NETWORK_IDLE: "האודיו/וידאו פעיל ומקור נבחר, אך הרשת אינה בשימוש",
    NETWORK_LOADING: "הדפדפן מוריד נתונים",
    NETWORK_NO_SOURCE: "לא נמצא מקור אודיו/וידאו",
    MEDIA_ERR_ABORTED: "תהליך האחזור בוטל על ידי המשתמש",
    MEDIA_ERR_NETWORK: "שגיאת רשת",
    MEDIA_ERR_DECODE: "שגיאת פענוח",
    MEDIA_ERR_SRC_NOT_SUPPORTED: "פורמט אודיו/וידאו לא נתמך",
    REPLAY: "נגן מחדש",
    ERROR: "נראה שיש בעיה בחיבור הרשת",
    PLAY_TIPS: "נגן",
    PAUSE_TIPS: "השהה",
    PLAYNEXT_TIPS: "הפרק הבא",
    DOWNLOAD_TIPS: "הורד",
    ROTATE_TIPS: "סובב",
    RELOAD_TIPS: "טען מחדש",
    FULLSCREEN_TIPS: "מסך מלא",
    EXITFULLSCREEN_TIPS: "צא ממסך מלא",
    CSSFULLSCREEN_TIPS: "מסך מלא CSS",
    EXITCSSFULLSCREEN_TIPS: "צא ממסך מלא CSS",
    TEXTTRACK: "כתוביות",
    PIP: "תמונה בתוך תמונה",
    SCREENSHOT: "צילום מסך",
    LIVE: "שידור חי",
    OFF: "כבוי",
    OPEN: "פתוח",
    MINI_DRAG: "לחץ והחזק לגרירת הווידאו",
    MINISCREEN: "מסך קטן",
    REFRESH_TIPS: "נסה",
    REFRESH: "רענן",
    FORWARD: "הרצה קדימה",
    LIVE_TIP: "שידור חי",
    TM_SUBTITLE_SHOW_TIPS: "הפעל כתוביות",
    TM_SUBTITLE_HIDE_TIPS: "כבה כתוביות",
    TM_MINIMIZE_TIPS: "הסתר וידאו"
  },
  privacyPolicy: {
    privacyPolicyTitle: "מדיניות פרטיות",
    lastUpdated: "עודכן לאחרונה: 25 באוגוסט, 2025",
    policyDescription:
      "מדיניות זו מתארת כיצד Scribify (להלן &quot;Scribify&quot;, &quot;שלנו&quot;, &quot;אנחנו&quot;) אוספת, משתמשת וחושפת את המידע האישי שלך כאשר אתה משתמש בשירותים ובאתרי האינטרנט שלנו.",
    websiteLink: "(https://www.scribify.ai/)",
    servicesDefinition: ", ותוכנה (ביחד, &quot;השירותים&quot;).",
    policyAgreement:
      "אנא קרא בעיון את מדיניות הפרטיות הזו וודא שאתה מבין אותה. על ידי שימוש בכל אחד מהשירותים שלנו, הנך מסכים למדיניות פרטיות זו. אם אינך מסכים לשימוש שלנו בנתונים האישיים שלך בהתאם למדיניות זו, עליך להפסיק את השימוש בשירותים שלנו באופן מיידי.",
    policyOverview:
      "במדיניות זו, אנו מפרטים: אילו נתונים אנו אוספים ומדוע; כיצד הנתונים שלך מטופלים; וזכויותיך ביחס לנתונים שלך. איננו מוכרים את הנתונים שלך.",
    scopeTitle: "1. היקף מדיניות פרטיות זו",
    whatWeCollectTitle: "2. מה אנו אוספים ומדוע",
    accessShareTitle: "3. מתי אנו ניגשים למידע שלך או משתפים אותו",
    secureDataTitle: "4. כיצד אנו מאבטחים את הנתונים שלך",
    deleteContentTitle: "5. מה קורה כשאתה מוחק את התוכן שלך",
    locationTitle: "6. מיקום האתר והנתונים",
    childrenPrivacyTitle: "7. פרטיות ילדים",
    updatesTitle: "8. עדכונים למדיניות פרטיות זו",
    contactUsTitle: "9. צרו קשר",
    identityAccessTitle: "2.1 זהות וגישה",
    billingInfoTitle: "2.2 פרטי חיוב",
    productInteractionsTitle: "2.3 אינטראקציות עם מוצרים",
    websiteInteractionsTitle: "2.4 אינטראקציות באתר",
    cookiesTitle: "2.5 עוגיות",
    voluntaryCorrespondenceTitle: "2.6 התכתבות מרצון",
    scopeContent:
      "מדיניות פרטיות זו חלה רק על איסוף ועיבוד מידע על ידינו אודות משתמשי השירותים. מדיניות פרטיות זו אינה חלה על שירותים, אתרי אינטרנט או תוכנה המופעלים על ידי צדדים שלישיים המקושרים אלינו (בין אם אנו מספקים קישורים אלה ובין אם משתמשים אחרים משתפים אותם), והיא אינה חלה על תוכן, נתונים, יישומים או חומרים מצדדים שלישיים. אנו ממליצים לך לבדוק את מדיניות הפרטיות של כל אתר אינטרנט או תוכנה של צד שלישי לפני שתספק להם מידע כלשהו.",
    collectPrinciple:
      "העיקרון המנחה שלנו הוא לאסוף רק את מה שאנחנו צריכים. הנה מה שזה אומר בפועל:",
    identityAccessContent:
      "כאשר אתם נרשמים לאחד מהמוצרים שלנו, אנו מבקשים מידע מזהה כגון שמכם וכתובת הדוא&quot;ל שלכם. זאת על מנת לספק פונקציונליות חיונית של המוצר וכדי שנוכל לשלוח לכם עדכוני מוצר ומידע חיוני אחר.",
    billingInfoContent:
      "אם תירשמו למוצר בתשלום, תתבקשו לספק את פרטי התשלום שלכם וכתובת החיוב. פרטי התשלום נשלחים ישירות למעבד התשלומים שלנו ואינם מגיעים לשרתים שלנו.",
    productInteractionsContent:
      "אנו מאחסנים בשרתים שלנו את התוכן שאתה מעלה, מקבל או מתחזק בחשבונות המוצר שלך. אלא אם כן תמחק תוכן זה, אנו עשויים לשמור תוכן זה כל עוד חשבונך פעיל.",
    websiteInteractionsContent:
      "אנו אוספים מידע על פעילות הגלישה שלך למטרות ניתוח וסטטיסטיקה כגון בדיקת שיעורי המרה וניסויים בעיצובים חדשים של מוצרים. זה כולל, לדוגמה, את גרסאות הדפדפן ומערכת ההפעלה שלך, כתובת ה-IP שלך, אילו דפי אינטרנט ביקרת וכמה זמן לקח להם להיטען, ואיזה אתר אינטרנט הפנה אותך אלינו. אם יש לך חשבון ואתה מחובר, נתוני ניתוח האינטרנט הללו מקושרים לכתובת ה-IP ולחשבון המשתמש שלך עד שהחשבון שלך כבר לא יהיה פעיל.",
    cookiesContent1:
      "אנו משתמשים גם בקובצי Cookie קבועים של צד ראשון ובקובצי Cookie מסוימים של צד שלישי כדי לאחסן העדפות מסוימות, להקל עליך את השימוש באפליקציות שלנו, לבצע בדיקות A/B וכן לתמוך בניתוחים מסוימים.",
    cookiesContent2:
      "קובץ Cookie הוא קטע טקסט המאוחסן על ידי הדפדפן שלך. הוא עשוי לעזור לזכור פרטי התחברות והעדפות אתר. הוא עשוי גם לאסוף מידע כגון סוג הדפדפן שלך, מערכת ההפעלה, דפי אינטרנט שבהם ביקרת, משך הביקור, תוכן שנצפה ונתוני קליקים אחרים. באפשרותך להתאים את הגדרות שמירת קובצי Cookie ולקבל או לחסום קובצי Cookie בודדים בהגדרות הדפדפן שלך, אם כי האפליקציות שלנו לא יעבדו והיבטים אחרים של השירות שלנו עשויים לא לפעול כראוי אם תכבה קובצי Cookie.",
    voluntaryCorrespondenceContent:
      "כאשר אתם שולחים לנו דוא&quot;ל עם שאלה או כדי לבקש עזרה, אנו שומרים את ההתכתבויות הללו, כולל כתובת הדוא&quot;ל שלכם, כך שתהיה לנו היסטוריה של התכתבויות קודמות לעיון אם תפנו אלינו בעתיד.",
    accessShareContent1:
      "כדי לספק מוצרים או שירותים שביקשת. אנו משתמשים בכמה מעבדי משנה של צד שלישי כדי לסייע בהפעלת היישומים שלנו ובמתן השירותים לך. זה כולל ספקי ענן ואנליטיקה.",
    accessShareContent2:
      "לחקור, למנוע או לנקוט פעולה בנוגע לניצול לרעה. גישה לחשבון של לקוח בעת חקירת ניצול לרעה אפשרי היא אמצעי אחרון. אנו רוצים להגן על הפרטיות והבטיחות של לקוחותינו ושל האנשים המדווחים לנו על בעיות, ואנו עושים כמיטב יכולתנו לאזן בין אחריות זו לאורך התהליך. אם נגלה שאתם משתמשים במוצרים שלנו למטרה מוגבלת, ננקוט פעולה כנדרש, כולל הודעה לרשויות המתאימות במידת הצורך.",
    accessShareContent3: "כאשר הדבר נדרש על פי החוק החל.",
    userDataRequests:
      "- בקשות לנתוני משתמשים. המדיניות שלנו היא לא להגיב לבקשות ממשלתיות לנתוני משתמשים אלא אם כן אנו מחויבים על ידי הליך משפטי או בנסיבות מוגבלות במקרה של בקשה דחופה. עם זאת, אם לרשויות אכיפת החוק בארה&quot;ב יש את הצו הנדרש, זימון פלילי או צו בית משפט המחייב אותנו לשתף נתונים, עלינו לציית. באופן דומה, נענה לבקשות מרשויות ממשלתיות מחוץ לארה&quot;ב רק אם ממשלת ארה&quot;ב מחויבת לכך באמצעות נהלים המפורטים באמנה או הסכם סיוע משפטי הדדי. מדיניותנו היא להודיע למשתמשים המושפעים לפני שאנו משתפים נתונים אלא אם כן אנו מנועים מכך על פי חוק, ולמעט במקרי חירום מסוימים.",
    preservationRequests:
      "- בקשות לשימור. באופן דומה, המדיניות שלנו היא להיענות לבקשות לשימור נתונים רק אם הדבר נדרש על פי חוק התקשורת המאוחסנת הפדרלי של ארה&quot;ב, סעיף 2703(f) לחוק 18 USC, או על פי זימון אמריקאי שהוגש כדין לעניינים אזרחיים. איננו משתפים נתונים שמורים אלא אם כן הדבר נדרש על פי חוק או מחויב על פי צו בית משפט שאנו בוחרים לא לערער עליו. יתר על כן, אלא אם כן נקבל צו, צו בית משפט או זימון מתאימים לפני תום תקופת השימור הנדרשת, נשמיד כל עותק שנשמר של נתוני הלקוח בתום תקופת השימור.",
    taxAudit:
      "- אם רשות המס מבקרת אותנו, ייתכן שנידרש לשתף מידע הקשור לחיוב. אם זה יקרה, נשתף רק את המינימום הנדרש, כגון כתובות לחיוב ומידע על פטור ממס.",
    secureDataContent1: "כל הנתונים מוצפנים באמצעות",
    sslTlsLink: "SSL/TLS",
    secureDataContent2: "כאשר הוא מועבר מהשרתים שלנו לדפדפן שלך.",
    deleteContentContent: "אם תמחק תוכן כלשהו, הוא יהיה בלתי נגיש באופן מיידי.",
    locationContent:
      "המוצרים שלנו ונכסי אינטרנט אחרים מופעלים בארצות הברית. אם אתם נמצאים באיחוד האירופי, בבריטניה או במקום אחר מחוץ לארצות הברית, אנא שימו לב שכל מידע שתספקו לנו יועבר לארצות הברית ויאוחסן בה. על ידי שימוש באתרי האינטרנט או בשירותים שלנו ו/או מתן המידע האישי שלכם לנו, הנכם מסכימים להעברה זו.",
    childrenPrivacyContent:
      "השירותים אינם מיועדים לילדים, ואיננו אוספים ביודעין מידע אישי מילדים מתחת לגיל 13. אם אתה מתחת לגיל 13, אנא אל תגיש מידע אישי כלשהו דרך השירותים. אם אתה מאמין שילד מסר לנו מידע אישי תוך הפרת מדיניות זו, אנא צור איתנו קשר כמצוין להלן.",
    updatesContent:
      "אנו עשויים לעדכן מדיניות זו לפי הצורך כדי לעמוד בתקנות הרלוונטיות ולשקף כל נוהג חדש. בכל פעם שנבצע שינוי משמעותי במדיניות שלנו, נעדכן את התאריך בראש עמוד זה.",
    contactUsContent1:
      "אם יש לכם שאלות, הערות או תלונות בנוגע למדיניות הפרטיות שלנו, אנא",
    contactUs: "צרו קשר",
    contactUsContent2: "ונעשה מאמץ לטפל בתלונתך בהקדם האפשרי."
  },
  termsOfService: {
    termsOfServiceTitle: "תנאי השירות",
    lastUpdated: "עודכן לאחרונה: 21 בספטמבר, 2022",
    thankYouMessage: "תודה שהשתמשתם במוצרים שלנו!",
    companyReference:
      "כאשר אנו אומרים &quot;חברה&quot;, &quot;אנחנו&quot;, &quot;שלנו&quot; או &quot;אותנו&quot; במסמך זה, אנו מתייחסים ל-Scribify.",
    servicesDefinition:
      "כשאנו אומרים &quot;שירותים&quot;, אנו מתכוונים לכל מוצר שנוצר ומתוחזק על ידי Scribify, בין אם מסופק בדפדפן אינטרנט, אפליקציית שולחן עבודה, אפליקציית מובייל או פורמט אחר.",
    termsUpdateNotice:
      "אנו עשויים לעדכן את תנאי השירות הללו בעתיד. בדרך כלל שינויים אלה נועדו להבהיר חלק מהתנאים הללו על ידי קישור למדיניות רלוונטית מורחבת. בכל פעם שנבצע שינוי משמעותי במדיניות שלנו, נרענן את התאריך בראש עמוד זה וננקוט בכל צעד מתאים אחר כדי להודיע לבעלי החשבונות.",
    acceptanceOfAgreementTitle: "1. קבלת ההסכם",
    scribifyServicesTitle: "2. שירותי Scribify",
    accountTermsTitle: "3. תנאי חשבון",
    paymentRefundsTitle: "4. תשלום, החזרים ושינויים בתוכנית",
    cancellationTerminationTitle: "5. ביטול וסיום עסקה",
    submissionsTitle: "6. הגשות",
    uptimeSecurityTitle: "7. זמן פעילות ואבטחה",
    siteManagementTitle: "8. ניהול אתר",
    copyrightContentTitle: "9. זכויות יוצרים ובעלות על תוכן",
    prohibitedActivitiesTitle: "10. פעילויות אסורות",
    featuresBugsTitle: "11. תכונות ובאגים",
    correctionsTitle: "12. תיקונים",
    userDataTitle: "13. נתוני משתמש",
    privacyPolicyTitle: "14. מדיניות פרטיות",
    liabilityTitle: "15. אחריות",
    miscellaneousTitle: "16. שונות",
    contactUsTitle: "17. צרו קשר",
    acceptanceContent1:
      "על ידי שימוש בשירותים שלנו, הנך מצהיר על קבלתך להסכם זה, אשר בכך הופך לחוזה מחייב בינך לבין Scribify. הנך מצהיר כי הנך רשאי מבחינה חוקית לקבל תנאים אלה, ומאשר כי הגעת לגיל החוקי לכריתת חוזה מחייב. קבלתה של Scribify מותנית במפורש בהסכמתך לכל התנאים וההגבלות של הסכם זה.",
    acceptanceContent2:
      "השירותים אינם מיועדים ואין להשתמש בהם על ידי אדם מתחת לגיל 18. על ידי שימוש בשירותים, הנך מצהיר ומתחייב כי אתה עומד בדרישות הזכאות הנ&quot;ל.",
    acceptanceContent3:
      "המונחים &quot;אתה&quot;, &quot;שלך&quot;, &quot;עצמך&quot; יכללו גם את עובדיך, סוכניך, נציגיך העסקיים וכל אדם אחר שאתה מספק לו גישה לשירותים דרך חשבונך (כהגדרתו להלן). אתה אחראי לוודא שכל האנשים שניגשים לשירותים דרך חשבונך מודעים לתנאים אלה ומצייתים להם.",
    acceptanceContent4:
      "Scribify שומרת לעצמה את הזכות לשנות ולעדכן תנאים אלה מעת לעת על פי שיקול דעתה הבלעדי. כל השינויים נכנסים לתוקף באופן מיידי עם פרסומם. המשך השימוש שלך בשירותים לאחר פרסום התנאים המתוקנים פירושו שאתה מקבל ומסכים לשינויים. עליך לבדוק דף זה מעת לעת כדי להיות מודע לכל שינוי, שכן הם מחייבים אותך.",
    servicesContent1:
      "השירותים שלנו מאפשרים למשתמשים להפוך שיחות קוליות לטקסט מתועתק שניתן לחפש, לתרגם ולשתף עם אחרים.",
    servicesContent2:
      "באפשרותך לבחור האם להשתמש בגרסה החינמית של השירותים (&quot;שירותים בחינם&quot;) או בגרסה בתשלום מבוססת מנוי של השירותים, עבורה ייתכן שתידרש לשלם עמלות (&quot;השירותים בתשלום&quot;).",
    servicesContent3:
      "אנו ננגיש לך את השירותים. אתה אחראי לבצע את כל הסידורים הנדרשים כדי שתהיה לך גישה לשירותים.",
    accountTerms1:
      "- אתה אחראי לשמירה על אבטחת חשבונך. החברה לא יכולה ולא תהיה אחראית לכל אובדן או נזק כתוצאה מאי עמידה בחובת אבטחה זו.",
    accountTerms2:
      "- אינך רשאי להשתמש בשירותים לכל מטרה בלתי חוקית, לא אתית או בלתי מוסרית.",
    accountTerms3:
      "- אתה אחראי לכל התוכן המתפרסם והפעילות המתרחשת במסגרת חשבונך. זה כולל תוכן המתפרסם על ידי אחרים אשר: (א) יש להם גישה לפרטי ההתחברות שלך; או (ב) יש להם פרטי התחברות משלהם בחשבונך.",
    accountTerms4:
      "- עליך להיות בן אדם. חשבונות הרשומים על ידי &quot;בוטים&quot; או שיטות אוטומטיות אחרות אינם מותרים.",
    paymentContent1:
      "- עבור שירותים בתשלום המציעים תקופת ניסיון בחינם, אנו מסבירים את משך תקופת הניסיון בעת ההרשמה. לאחר תקופת הניסיון, עליך לשלם מראש כדי להמשיך להשתמש בשירות. אם לא תשלם, שירותים אלה יסתיימו.",
    paymentContent2:
      "אם אתם משדרגים מתוכנית חינמית לתוכנית בתשלום, נחייב את כרטיס האשראי שלכם באופן מיידי ומחזור החיוב שלכם יתחיל ביום השדרוג.",
    paymentContent3:
      "- כל העמלות אינן כוללות את כל המסים, ההיטלים או המכסים המוטלים על ידי רשויות המס. במידת הצורך, נגבה את המסים הללו מטעם רשות המס ונעביר אותם לרשויות המס. אחרת, אתה אחראי לתשלום כל המסים, ההיטלים או המכסים.",
    paymentContent4:
      "- כל הרכישות אינן ניתנות להחזר כספי. ניתן לבטל כל שירות בתשלום בכל עת על ידי כניסה לחשבונך. עבור מנויים בתשלום, הביטול ייכנס לתוקף בסוף התקופה הנוכחית בתשלום, אלא אם כן צוין אחרת.",
    cancellationContent1:
      "- אם תבטל את השירות לפני תום תקופת התשלום, הביטול ייכנס לתוקף באופן מיידי, ולא תחויב שוב. איננו מבצעים חישוב יחסי אוטומטי של זמן שלא נוצל במחזור החיוב האחרון.",
    cancellationContent2:
      "- יש לנו את הזכות להשעות או לסגור את חשבונך ולסרב לכל שימוש נוכחי או עתידי בשירותים שלנו מכל סיבה ובכל עת. השעיה פירושה שלא תוכל לגשת לחשבון או לכל תוכן בחשבון. סגירה תביא בנוסף למחיקת חשבונך או לגישתך לחשבונך, ולחילוט וויתור על כל התוכן בחשבונך. אנו שומרים לעצמנו את הזכות לסרב את השימוש בשירותים לכל אחד מכל סיבה ובכל עת. סעיף זה קיים משום שמבחינה סטטיסטית, מתוך מאות אלפי חשבונות בשירותים שלנו, יש לפחות אחד שעושה משהו מרושע.",
    cancellationContent3:
      "- התעללות מילולית, פיזית, בכתב או אחרת (לרבות איומי התעללות או גמול) של עובד או נושא משרה בחברה עלולה לגרום לסגירת חשבון באופן מיידי.",
    submissionsContent:
      "הנך מאשר ומסכים כי כל שאלה, הערה, הצעה, רעיון, משוב או מידע אחר בנוגע לאתר (&quot;הגשות&quot;) שתספק לנו אינם סודיים ויהפכו לרכושנו הבלעדי. אנו הבעלים של זכויות בלעדיות, לרבות כל זכויות הקניין הרוחני, ונהיה זכאים לשימוש והפצה בלתי מוגבלים של הגשות אלה לכל מטרה חוקית, מסחרית או אחרת, ללא הכרה או פיצוי כלפיך. בזאת הנך מוותר על כל הזכויות המוסריות לכל הגשות כאמור, ואתה מתחייב בזאת שכל הגשות כאמור הן מקוריות שלך או שיש לך את הזכות להגיש הגשות כאמור. הנך מסכים שלא תהיה כל עילה נגדנו בגין כל הפרה או שימוש לרעה לכאורה או בפועל של כל זכות קניינית בהגשות שלך.",
    uptimeContent1:
      "- השימוש שלך בשירותים הוא על אחריותך הבלעדית. אנו מספקים שירותים אלה &quot;כפי שהם&quot; ו&quot;כפי שהם זמינים&quot;. איננו מציעים הסכמי רמת שירות עבור רוב השירותים שלנו, אך מתייחסים ברצינות לזמן הפעילות של היישומים שלנו.",
    uptimeContent2:
      "אנו שומרים לעצמנו את הזכות להשבית זמנית את חשבונך אם השימוש שלך חורג משמעותית מהשימוש הרגיל של לקוחות אחרים של השירותים. כמובן, ניצור איתך קשר לפני נקיטת פעולה כלשהי, למעט במקרים נדירים שבהם רמת השימוש עלולה להשפיע לרעה על ביצועי השירות עבור לקוחות אחרים.",
    uptimeContent3:
      "אנו נוקטים באמצעים רבים כדי להגן ולאבטח את הנתונים שלך באמצעות גיבויים, יתירות והצפנה. אנו אוכפים הצפנה להעברת נתונים דרך האינטרנט הציבורי.",
    uptimeContent4:
      "אנו משתמשים בספקי צד שלישי ובשותפי אירוח כדי לספק את החומרה, התוכנה, הרשתות, האחסון והטכנולוגיה הנלווית הנדרשים להפעלת השירותים.",
    siteManagementContent:
      "אנו שומרים לעצמנו את הזכות, אך לא את החובה, ל: (1) לנטר את האתר בגין הפרות של תנאי שירות אלה; (2) לנקוט בצעדים משפטיים מתאימים נגד כל מי אשר, לפי שיקול דעתנו הבלעדי, מפר את החוק או את תנאי השירות הללו, לרבות, בין היתר, דיווח על משתמש כזה לרשויות אכיפת החוק; (3) לפי שיקול דעתנו הבלעדי וללא הגבלה, לסרב, להגביל את הגישה, להגביל את הזמינות של, או להשבית (במידה שהדבר אפשרי מבחינה טכנולוגית) כל אחת מהתרומות שלך או כל חלק מהן; (4) לפי שיקול דעתנו הבלעדי וללא הגבלה, הודעה או אחריות, להסיר מהאתר או להשבית בכל דרך אחרת את כל הקבצים והתכנים שהם בגודלם מופרז או מכבידים בכל דרך שהיא על המערכות שלנו; ו-(5) לנהל את האתר באופן אחר באופן שנועד להגן על זכויותינו ורכושנו ולהקל על תפקודו התקין של האתר.",
    copyrightContent1:
      "- כל התוכן המתפרסם בשירותים חייב לעמוד בחוק זכויות היוצרים של ארה&quot;ב.",
    copyrightContent2:
      "- איננו טוענים לזכויות קניין רוחני על החומר שאתה מספק לשירותים. כל החומרים המועלים נשארים שלך.",
    copyrightContent3:
      "איננו מבצעים סינון מוקדם של תוכן, אך שומרים לעצמנו את הזכות (אך לא את החובה) לפי שיקול דעתנו הבלעדי לסרב או להסיר כל תוכן הזמין דרך השירות.",
    copyrightContent4:
      "- השמות, המראה והתחושה של השירותים הינם זכויות יוצרים © של החברה. כל הזכויות שמורות. אין לשכפל, להעתיק או לעשות שימוש חוזר בכל חלק מ-HTML, CSS, JavaScript או אלמנטים עיצוביים חזותיים ללא אישור מפורש בכתב מהחברה. עליך לבקש אישור להשתמש בלוגו של החברה או בכל לוגו של השירות למטרות קידום מכירות. אנא",
    emailUs: "שלח לנו דוא&quot;ל",
    copyrightContent5:
      "בקשות לשימוש בלוגואים. אנו שומרים לעצמנו את הזכות לבטל הרשאה זו אם תפר את תנאי השירות הללו.",
    copyrightContent6:
      "- הנך מסכים שלא לשכפל, לשכפל, להעתיק, למכור, למכור מחדש או לנצל כל חלק מהשירותים, שימוש בשירותים או גישה לשירותים ללא אישור מפורש בכתב מהחברה.",
    copyrightContent7:
      "- אסור לך לשנות אתר אינטרנט אחר באופן שירמוז באופן שקרי שהוא קשור לשירותים או לחברה.",
    copyrightContent8:
      "אנו מכבדים את זכויות הקניין הרוחני של אחרים. אם אתם סבורים כי חומר כלשהו הזמין באתר או דרכו מפר זכויות יוצרים שבבעלותכם או בשליטתכם, אנא מיד...",
    contactUs: "צרו קשר",
    copyrightContent9:
      "עותק של ההודעה שלך יישלח לאדם שפרסם או אחסן את החומר הנדון בהודעה. שים לב כי בהתאם לחוק החל, אתה עלול להיות אחראי לנזקים אם תמסור מצגי שווא מהותיים בהודעה. לכן, אם אינך בטוח שחומר הממוקם באתר או שאליו מקושר האתר מפר את זכויות היוצרים שלך, עליך לשקול תחילה לפנות לעורך דין.",
    prohibitedActivitiesIntro:
      "אינך רשאי לגשת לאתר או להשתמש בו לכל מטרה אחרת מלבד זו שלשמה אנו מעמידים את האתר לרשותך. אין להשתמש באתר בקשר למאמצים מסחריים כלשהם מלבד אלו שאושרו או אושרו על ידינו במפורש.",
    prohibitedActivitiesUserAgreement: "כמשתמש באתר, הנך מסכים שלא:",
    prohibitedActivity1:
      "- לאחזר באופן שיטתי נתונים או תוכן אחר מהאתר כדי ליצור או לקמפל, באופן ישיר או עקיף, אוסף, קומפילציה, מסד נתונים או ספרייה ללא אישור בכתב מאיתנו.",
    prohibitedActivity2:
      "- להערים, להונות או להטעות אותנו ואת משתמשים אחרים, במיוחד בכל ניסיון ללמוד מידע רגיש על החשבון כגון סיסמאות משתמשים.",
    prohibitedActivity3:
      "- לעקוף, להשבית או להפריע בדרך אחרת לתכונות הקשורות לאבטחה של האתר, לרבות תכונות המונעות או מגבילות את השימוש או ההעתקה של כל תוכן או או אוכפות מגבלות על השימוש באתר ו/או בתוכן הכלול בו.",
    prohibitedActivity4:
      "- לזלזל, להכתים או לפגוע בכל דרך אחרת, לדעתנו, בנו ו/או באתר.",
    prohibitedActivity5:
      "- להשתמש בכל מידע שהתקבל מהאתר על מנת להטריד, להתעלל או לפגוע באדם אחר.",
    prohibitedActivity6:
      "- לעשות שימוש לא ראוי בשירותי התמיכה שלנו או להגיש דיווחים כוזבים על התעללות או התנהגות בלתי הולמת.",
    prohibitedActivity7:
      "- להשתמש באתר באופן שאינו עולה בקנה אחד עם כל חוק או תקנות רלוונטיים.",
    prohibitedActivity8: "- לעסוק במסגור או קישורים לאתר באופן בלתי מורשה.",
    prohibitedActivity9:
      "- להעלות או לשדר (או לנסות להעלות או לשדר) וירוסים, סוסים טרויאניים או חומר אחר, לרבות שימוש מופרז באותיות גדולות וספאם (פרסום רציף של טקסט חוזר), אשר מפריעים לשימוש ולהנאה רצופים של צד כלשהו מהאתר או משנים, פוגעים, משבשים, משנה או מפריע לשימוש, לתכונות, לתפקודים, לתפעול או לתחזוקה של האתר.",
    prohibitedActivity10:
      "- לעסוק בכל שימוש אוטומטי במערכת, כגון שימוש בסקריפטים לשליחת תגובות או הודעות, או שימוש בכלי כריית נתונים, רובוטים או כלי איסוף וחילוץ נתונים דומים.",
    prohibitedActivity11:
      "- מחיקת הודעת זכויות יוצרים או זכויות קניין אחרות מכל תוכן.",
    prohibitedActivity12:
      "- ניסיון להתחזות למשתמש או אדם אחר או להשתמש בשם המשתמש של משתמש אחר.",
    prohibitedActivity13:
      "- להעלות או לשדר (או לנסות להעלות או לשדר) כל חומר הפועל כמנגנון איסוף או שידור מידע פסיבי או אקטיבי, לרבות, בין היתר, פורמטי חילופי גרפיקה שקופים (&quot;GIFs&quot;), פיקסלים בגודל 1×1, באגים ברשת, קובצי Cookie או התקנים דומים אחרים (המכונים לעיתים &quot;תוכנות ריגול&quot; או &quot;מנגנוני איסוף פסיביים&quot; או &quot;PCMS&quot;).",
    prohibitedActivity14:
      "- להפריע, לשבש או ליצור עומס בלתי סביר על האתר או על הרשתות או השירותים המחוברים לאתר.",
    prohibitedActivity15:
      "- להטריד, להרגיז, להפחיד או לאיים על כל אחד מעובדינו או סוכנינו המעורבים במתן כל חלק מהאתר לך.",
    prohibitedActivity16:
      "- ניסיון לעקוף כל אמצעי של האתר שנועדו למנוע או להגביל את הגישה לאתר, או לכל חלק ממנו.",
    prohibitedActivity17:
      "- להעתיק או להתאים את תוכנת האתר, לרבות אך לא רק Flash, PHP, HTML, JavaScript או קוד אחר.",
    prohibitedActivity18:
      "- למעט כפי שמותר על פי חוק, לפענח, לפרק, להרכיב מחדש או לבצע הנדסה הפוכה של כל תוכנה המרכיבה או בכל דרך שהיא חלק מהאתר.",
    prohibitedActivity19:
      "- למעט ככל שיהיו כתוצאה משימוש רגיל במנוע חיפוש או בדפדפן אינטרנט, להשתמש, להפעיל, לפתח או להפיץ כל מערכת אוטומטית, לרבות, בין היתר, כל עכביש, רובוט, כלי רמאות, סקרייפר או קורא לא מקוון שניגש לאתר, או שימוש או הפעלה של כל סקריפט או תוכנה אחרת לא מורשים.",
    prohibitedActivity20:
      "- השתמשו בסוכן קנייה או סוכן רכש לביצוע רכישות באתר.",
    prohibitedActivity21:
      "- לעשות כל שימוש בלתי מורשה באתר, לרבות איסוף שמות משתמש ו/או כתובות דוא&quot;ל של משתמשים באמצעים אלקטרוניים או אחרים לצורך שליחת דוא&quot;ל לא רצוי, או יצירת חשבונות משתמש באמצעים אוטומטיים או בתואנות שווא.",
    prohibitedActivity22:
      "- להשתמש באתר כחלק מכל מאמץ להתחרות בנו או להשתמש באתר ו/או בתוכן לכל מאמץ להפקת הכנסות או מיזם מסחרי.",
    prohibitedActivity23:
      "- להשתמש באתר כדי לפרסם או להציע למכור סחורות ושירותים.",
    prohibitedActivity24: "- למכור או להעביר את הפרופיל שלך בדרך אחרת.",
    featuresContent1:
      "אנו מעצבים את השירותים שלנו בקפידה, בהתבסס על ניסיוננו האישי ועל חוויותיהם של לקוחות שחולקים את זמנם ומשובם. עם זאת, אין דבר כזה שירות שמשמח את כולם. איננו מתחייבים שהשירותים שלנו יעמדו בדרישות או בציפיות הספציפיות שלכם.",
    featuresContent2:
      "אנו בודקים גם את כל התכונות שלנו לפני משלוחן. כמו בכל תוכנה, גם בשירותים שלנו יש באופן בלתי נמנע כמה באגים. אנו עוקבים אחר הבאגים המדווחים לנו ועובדים עליהם, במיוחד כל אלה הקשורים לאבטחה או פרטיות. לא כל הבאגים המדווחים יתוקנו ואנחנו לא מבטיחים שירותים נקיים לחלוטין משגיאות.",
    correctionsContent1:
      "ייתכן שיהיה מידע באתר המכיל שגיאות דפוס, אי דיוקים או השמטות, לרבות תיאורים, תמחור, זמינות ומידע מגוון אחר. אנו שומרים לעצמנו את הזכות לתקן כל שגיאה, אי דיוק או השמטה ולשנות או לעדכן את המידע באתר בכל עת, ללא הודעה מוקדמת.",
    correctionsContent2:
      "איננו יכולים להבטיח שהאתר יהיה זמין בכל עת. אנו עשויים להיתקל בבעיות חומרה, תוכנה או בעיות אחרות, או שנצטרך לבצע תחזוקה הקשורה לאתר, מה שיוביל להפרעות, עיכובים או שגיאות. אנו שומרים לעצמנו את הזכות לשנות, לתקן, לעדכן, להשעות, להפסיק או לשנות בכל דרך אחרת את האתר בכל עת או מכל סיבה שהיא ללא הודעה מוקדמת אליך. הנך מסכים כי איננו נושאים באחריות כלשהי לכל אובדן, נזק או אי נוחות שייגרמו עקב חוסר היכולת שלך לגשת לאתר או להשתמש בו במהלך כל השבתה או הפסקה של האתר. שום דבר בתנאי שירות אלה לא יתפרש כמחייב אותנו לתחזק ולתמוך באתר או לספק תיקונים, עדכונים או שחרורים בקשר לכך.",
    userDataContent:
      "אנו נשמור נתונים מסוימים שתעביר לאתר לצורך ניהול ביצועי האתר, כמו גם נתונים הקשורים לשימושך באתר. למרות שאנו מבצעים גיבויים שוטפים של נתונים, אתה האחראי הבלעדי לכל הנתונים שתעביר או הקשורים לכל פעילות שביצעת באמצעות האתר. אתה מסכים כי לא נהיה אחראים כלפיך בגין כל אובדן או פגיעה של נתונים כאלה, ואתה מוותר בזאת על כל זכות תביעה נגדנו הנובעת מכל אובדן או פגיעה של נתונים כאלה.",
    privacyPolicyContent1: "אנו דואגים לפרטיות ואבטחת מידע. אנא עיינו ב",
    privacyPolicy: "מדיניות פרטיות",
    privacyPolicyContent2:
      "על ידי שימוש באתר, הנך מסכים להיות כפוף למדיניות הפרטיות שלנו, המשולבת בתנאי שירות אלה. שימו לב כי האתר מתארח בארצות הברית. אם אתם ניגשים לאתר מכל אזור אחר בעולם שבו חוקים או דרישות אחרות המסדירות איסוף, שימוש או גילוי של נתונים אישיים השונים מהחוקים החלים בארצות הברית, אזי באמצעות המשך השימוש באתר, הנך מעביר את הנתונים שלך לארצות הברית, ואתה מסכים שהנתונים שלך יועברו ויעובדו בארצות הברית.",
    liabilityIntro:
      "אנו מזכירים אחריות לאורך כל תנאים אלה, אך כדי לרכז את הכל בסעיף אחד:",
    liabilityContent:
      "הנך מבין ומסכים במפורש כי החברה לא תהיה אחראית, על פי חוק או על פי יושר, כלפיך או כלפי צד שלישי כלשהו, בגין כל נזק ישיר, עקיף, מקרי, אובדן רווחים, נזקים מיוחדים, תוצאתיים, עונשיים או נזקים לדוגמה, לרבות, אך לא רק, נזקים בגין אובדן רווחים, מוניטין, שימוש, נתונים או הפסדים בלתי מוחשיים אחרים (גם אם החברה קיבלה הודעה על האפשרות של נזקים כאלה), הנובעים מ: (1) השימוש או חוסר היכולת להשתמש בשירותים; (2) שגיאות, טעויות או אי דיוקים בתוכן ובחומרים; (3) פגיעה אישית או נזק לרכוש, מכל סוג שהוא, הנובעים מגישתך לאתר ושימושך בו; (4) עלות רכישת סחורות ושירותים חלופיים הנובעים מכל סחורה, נתונים, מידע או שירותים שנרכשו או התקבלו או הודעות שהתקבלו או עסקאות שבוצעו באמצעות השירותים או מהם; (5) כל גישה בלתי מורשית או שימוש בשרתים המאובטחים שלנו ו/או בכל מידע אישי ו/או מידע פיננסי המאוחסן בהם; (6) כל הפרעה או הפסקה של שידור אל האתר או ממנו; (7) כל באגים, וירוסים, סוסים טרויאניים או דברים דומים אשר עשויים להיות מועברים לאתר או דרכו על ידי צד שלישי כלשהו, ו/או; (8) כל שגיאה או השמטה בכל תוכן וחומר או כל אובדן או נזק מכל סוג שהוא שנגרם כתוצאה משימוש בכל תוכן שפורסם, מועבר או זמין בדרך אחרת דרך האתר; (9) הצהרות או התנהגות של צד שלישי כלשהו בשירות; (10) או כל עניין אחר הקשור לתנאי שירות אלה או לשירותים, בין אם כהפרת חוזה, נזיקין (לרבות רשלנות אקטיבית או פסיבית), או כל תיאוריה אחרת של אחריות.",
    miscellaneousContent:
      "תנאי שירות אלה וכל מדיניות או כללי הפעלה שפורסמו על ידינו באתר או ביחס לאתר מהווים את ההסכם וההבנה המלאים בינך לבינינו. אי-מימוש או אכיפה של כל זכות או הוראה מתנאי שירות אלה לא יהווה ויתור על זכות או הוראה כאמור. תנאי שירות אלה פועלים במידה המלאה ביותר המותרת על פי חוק. אנו רשאים להמחות את כל זכויותינו וחובותינו לאחרים בכל עת. לא נהיה אחראים לכל אובדן, נזק, עיכוב או אי-פעולה שנגרמו מכל סיבה שאינה בשליטתנו הסבירה. אם הוראה כלשהי או חלק מהוראה מתנאי שירות אלה ייקבע כבלתי חוקית, בטל או בלתי ניתנת לאכיפה, הוראה זו או חלק מהוראה ייחשבו כניפרדים מתנאי שירות אלה ואינם משפיעים על תוקפן ואכיפתם של כל הוראה שנותרה. לא נוצרו יחסי מיזם משותף, שותפות, העסקה או סוכנות בינך לבינינו כתוצאה מתנאי שירות אלה או משימוש באתר. הנך מסכים כי תנאי שירות אלה לא יתפרשו כנגדנו מכוח ניסוחם. בזאת הנך מוותר על כל הגנה שעשויה להיות לך המבוססת על הטופס האלקטרוני של תנאי שירות אלה ועל היעדר חתימה מצד הצדדים לתנאי שירות אלה.",
    contactUsContent1: "אם יש לכם שאלה לגבי תנאי השירות, אנא",
    contactUsContent2: "."
  }
};

export default defineI18nLocale(async locale => {
  return message
})

export { message }
