// 乌克兰语
let message = {
  HomePage: {
    home: "Головна",
    version: "Базова версія (безкоштовно):",
    times:
      "{times} безкоштовних транскрипцій на день, {left} залишилося сьогодні. ",
    tips: "Оновіться до Pro для необмежених транскрипцій.",
    update: "Оновити зараз",
    folders: "Папки",
    rename: "Перейменувати",
    delete: "Видалити",
    createTitle: "Створити папку",
    deleteConfirm:
      "Ви впевнені, що хочете видалити цю папку та всі файли в ній?",
    cancel: "Скасувати",
    confirm: "Створити",
    dialogLabel: "Назва папки",
    recently: "Нещодавні файли",
    loading: "Завантаження",
    tour: {
      step0: {
        title: "Ласкаво просимо до {name}",
        tip: "Тут ви можете:",
        content: "Транскрибувати розмови, зустрічі, лекції тощо",
        next: "Почати користуватися"
      },
      step1: {
        title: "Транскрибувати файли",
        content:
          "Підтримує три способи транскрипції: локальні файли, посилання та запис."
      },
      step2: {
        title: "Створити папку",
        content: 'Натисніть "+" щоб створити папку та організувати файли.'
      },
      step3: {
        title: "Переглянути деталі та редагувати",
        content:
          "Натисніть на елемент, щоб переглянути деталі транскрипції та редагувати. Також можливий переклад."
      },
      next: "Далі",
      finish: "Зрозуміло"
    },
    export: {
      export: "Експортувати",
      title: "Створюємо файл експорту",
      title2: "Ваш файл готовий",
      singleLoadingContent: "Стискаємо 1 файл.",
      singleSuccessContent: "Стиснуто 1 файл.",
      loadingContent: "Стискаємо {num} файлів.",
      successContent: "Стиснуто {num} файлів.",
      cancel: "Скасувати експорт",
      error: "Помилка експорту",
      dialog: {
        title: "Попередження",
        content: "Скасувати експорт?",
        cancel: "Скасувати експорт",
        continue: "Продовжити експорт"
      }
    },
    welcome: {
      title: "Ласкаво просимо до Scribify!",
      description: "Тут ви можете:",
      transcribe:
        "Без зусиль транскрибувати з Scribify—перетворювати голосові розмови в чіткий, пошуковий та спільний текст миттєво.",
      precision:
        "Отримувати точні транскрипції з ідентифікацією мовців та часовими мітками миттєво.",
      translate:
        "Долати мовні бар'єри: перекладати транскрипції на понад 200 мов з легкістю.",
      edit: "Редагувати, вдосконалювати та експортувати свої транскрипції у форматах, що відповідають вашим потребам.",
      collaborate: "Співпрацювати, ділячись транскрибованим текстом з іншими.",
      button: "Почати",
      tip: "Готові перетворити аудіо в транскрибований текст? Почніть досліджувати зараз!",
      tip2: "Почніть досліджувати зараз!",
      tip1: "Готові перетворити аудіо на транскрибований текст? "
    },
    subscriptionModal: {
      left: {
        title: "Отримайте Pro План для розблокування більшого",
        c1: "Необмежені транскрипції",
        c2: "10-годинні завантаження",
        c3: "Найвищий пріоритет",
        c4: "99% точність транскрипції",
        c5: "Понад 100 підтримуваних мов",
        c6: "Ідентифікація мовців",
        c7: "Переклад транскрипції",
        t1: "Необмежені транскрипції для однієї особи.",
        t2: "Кожен файл може бути до 10 годин / 5 ГБ. Завантажуйте 50 файлів одночасно.",
        t3: "Ми завжди транскрибуємо ваші файли якомога швидше з найвищим пріоритетом."
      },
      right: {
        title: "Отримати Pro План",
        yearly: "Річний",
        monthly: "Місячний",
        save: "Економія",
        preMonth: "на місяць",
        preYear: "на рік",
        firstMonth: "перший місяць",
        afterwards: "після"
      },
      subscribe: "Підписатися"
    }
  },
  FolderPage: {
    table: {
      name: "Назва",
      duration: "Тривалість",
      status: "Статус",
      date: "Дата створення",
      activity: "Активність",
      empty1: "Тут порожньо.",
      empty2: "Натисніть кнопку вгорі для транскрипції файлу.",
      just: "Щойно",
      export: "Експортувати",
      delete: "Видалити",
      share: "Поділитися",
      rename: "Перейменувати",
      move: "Перемістити",
      failed: "Невдача",
      selected: "Вибрано",
      success: "Успішно",
      fileList: "Список файлів"
    },
    dialog: {
      move: {
        title: "Перемістити",
        label: "Вибрати папку",
        placeholder: "Вибрати папку",
        confirm: "Перемістити",
        cancel: "Скасувати"
      },
      rename: {
        title: "Перейменувати",
        label: "Назва файлу",
        confirm: "Перейменувати",
        cancel: "Скасувати"
      },
      delete: {
        title: "Видалити",
        file: "файл",
        files: "файли",
        label: "Підтвердити видалення? Цю дію неможливо скасувати.",
        confirm: "Видалити",
        cancel: "Скасувати"
      },
      share: {
        title: "Поділитися",
        label:
          "Будь-хто з цим захищеним посиланням зможе переглянути транскрипцію та пов'язані медіафайли.",
        confirm: "Копіювати посилання",
        success: "Успішно скопійовано"
      },
      export: {
        title: "Експортувати",
        select: "Виберіть потрібний формат",
        settings: "Налаштування",
        speaker: "Включити спікера",
        timecodes: "Включити часові коди",
        confirm: "Експортувати",
        cancel: "Скасувати",
        selectErr: "Будь ласка, виберіть один або кілька форматів"
      }
    },
    search: {
      placeholder: "Пошук"
    },
    recently: "Нещодавні",
    record: "Запис",
    transcribe: "Транскрибувати",
    unclassified: "Некласифікована папка",
    buttons: {
      transcribe: "Транскрибувати файл",
      url: "Транскрибувати посилання",
      record: "Записати та транскрибувати",
      recording: "Запис..."
    },
    delSuccess: "Успішно видалено",
    create: "Створити"
  },
  FileUploadAndRecording: {
    record: {
      record: "Запис",
      pause: "Пауза",
      resume: "Продовжити",
      stop: "Зупинити",
      endRecord: "Завершити запис",
      delete: "Видалити",
      transcribe: "Транскрибувати",
      permissionDenied: "Доступ до мікрофону заборонено або пристрій не існує",
      dialog: {
        delete: {
          title: "Попередження",
          label: "Ви впевнені, що хочете видалити цей запис?",
          confirm: "Видалити",
          cancel: "Скасувати"
        },
        complete: {
          title: "Запис завершено",
          label:
            "Запис досяг 10 годин і автоматично зупинився. Будь ласка, транскрибуйте його.",
          confirm: "Зрозуміло"
        }
      }
    },
    upload: {
      link: {
        dialogTitle: "Транскрибувати онлайн-медіа",
        title: "Вставити посилання",
        label:
          "Вставте посилання на медіа з YouTube, Facebook, X, Dropbox, Google Drive, Vimeo та інших платформ",
        confirm: "Додати",
        cancel: "Скасувати",
        errorTitle:
          "Введене посилання некоректне. Будь ласка, перевірте та спробуйте знову.",
        linkName: "Посилання"
      },
      file: {
        orTitle: "Транскрибувати онлайн-медіа",
        dialogTitle: "Транскрибувати файл",
        tip1: "Натисніть, щоб завантажити",
        tip2: "або перетягніть",
        or: "або"
      },
      del: {
        title: "Попередження",
        content:
          "Весь прогрес буде втрачено. Підтвердити скасування транскрипції?",
        cancel: "Підтвердити скасування",
        confirm: "Продовжити транскрипцію"
      },
      files: "Файли",
      resultDialogTitle: "Транскрибувати файл",
      resultDialogTitle2: "Транскрибувати файл",
      cancel: "Скасувати",
      confirm: "Транскрибувати",
      return: "Повернутися",
      addMore: "Додати ще",
      language: "Мова медіа",
      failed: "Невдача",
      tooLarge: "Файл занадто великий.",
      linkUpload: "Завантаження...",
      fileFormat: "Формат файлу не підтримується",
      localFiles: "Локальні файли",
      pasteLink: "Онлайн-посилання",
      uploadErr: "Помилка завантаження",
      hashErr: "Помилка хешування",
      table: {
        status: "Статус",
        file: "Файл",
        size: "Розмір",
        noData: "Немає даних"
      },
      maxFileNum: "Кількість файлів не може перевищувати {num}.",
      speaker: "Ідентифікація мовця",
      speakerLabel: "Позначте кожен сегмент транскрипту людиною, яка говорить."
    }
  },
  TranscriptionPage: {
    edit: "Редагувати",
    translate: "Перекласти",
    showSpeaker: "Показати спікера",
    showTimestamp: "Показати часові мітки",
    share: "Поділитися",
    shared: "Поділено",
    export: "Експортувати",
    speaker: "Спікер_{id}",
    unassignSpeaker: "Скасувати призначення спікера",
    play: "Відтворити",
    save: "Зберегти",
    undo: "Скасувати",
    redo: "Повторити",
    confirm: "Підтвердити",
    cancel: "Скасувати",
    addNew: "Додати новий",
    createANewSpeaker: "Створити нового спікера",
    speakerName: "Ім'я спікера",
    addSpeaker: "Додати спікера",
    applyToAllMatchingSpeakers: "Застосувати до всіх відповідних спікерів",
    cancelTranslation: "Скасувати переклад",
    showVideo: "Показати відео",
    hideVideo: "Приховати відео",
    langChooseV1: {
      recently: "Нещодавні",
      popular: "Популярні",
      other: "Інші",
      searchLanguage: "Пошук мови",
      noMatch: "Мову не знайдено",
      English: "Англійська",
      "English(US)": "Англійська (США)",
      "English(UK)": "Англійська (Великобританія)",
      Spanish: "Іспанська",
      Portuguese: "Португальська",
      French: "Французька",
      Italian: "Італійська",
      German: "Німецька",
      Dutch: "Нідерландська",
      Polish: "Польська",
      Danish: "Данська",
      Japanese: "Японська",
      Korean: "Корейська",
      Hungarian: "Угорська",
      Czech: "Чеська",
      Chinese: "Китайська",
      Hebrew: "Іврит",
      Arabic: "Арабська",
      Azerbaijani: "Азербайджанська",
      Estonian: "Естонська",
      Belarusian: "Білоруська",
      Bulgarian: "Болгарська",
      Icelandic: "Ісландська",
      Bosnian: "Боснійська",
      Persian: "Перська",
      Russian: "Російська",
      "Chinese(Traditional)": "Китайська (традиційна)",
      Finnish: "Фінська",
      Kazakh: "Казахська",
      Galician: "Галісійська",
      Catalan: "Каталонська",
      "Chinese(Simplified)": "Китайська (спрощена)",
      Kannada: "Каннада",
      Croatian: "Хорватська",
      Latvian: "Латвійська",
      Lithuanian: "Литовська",
      Romanian: "Румунська",
      Marathi: "Маратхі",
      Malay: "Малайська",
      Macedonian: "Македонська",
      Maori: "Маорі",
      Afrikaans: "Африкаанс",
      Nepali: "Непальська",
      Norwegian: "Норвезька",
      Swedish: "Шведська",
      Serbian: "Сербська",
      Slovak: "Словацька",
      Slovenian: "Словенська",
      Swahili: "Суахілі",
      Tagalog: "Тагальська",
      Tamil: "Тамільська",
      Thai: "Тайська",
      Turkish: "Турецька",
      Welsh: "Валлійська",
      Urdu: "Урду",
      Ukrainian: "Українська",
      Greek: "Грецька",
      Armenian: "Вірменська",
      Hindi: "Хінді",
      Indonesian: "Індонезійська",
      Vietnamese: "В'єтнамська",
      Albanian: "Албанська",
      Amharic: "Амхарська",
      Assamese: "Ассамська",
      Occitan: "Окситанська",
      Bashkir: "Башкирська",
      Basque: "Баскська",
      Breton: "Бретонська",
      Tibetan: "Тибетська",
      Faroese: "Фарерська",
      Sanskrit: "Санскрит",
      Khmer: "Кхмерська",
      Georgian: "Грузинська",
      Gujarati: "Гуджараті",
      "Haitian Creole": "Гаїтянська креольська",
      Hausa: "Хауса",
      Latin: "Латинська",
      Lao: "Лаоська",
      Lingala: "Лінгала",
      Luxembourgish: "Люксембурзька",
      Malagasy: "Малагасійська",
      Maltese: "Мальтійська",
      Malayalam: "Малаялам",
      Mongolian: "Монгольська",
      Bengali: "Бенгальська",
      Burmese: "Бірманська",
      Punjabi: "Панджабі",
      Pashto: "Пушту",
      Sinhala: "Сингальська",
      Shona: "Шона",
      Somali: "Сомалійська",
      Tajik: "Таджицька",
      Tatar: "Татарська",
      Telugu: "Телугу",
      Turkmen: "Туркменська",
      Uzbek: "Узбецька",
      Hawaiian: "Гавайська",
      "Norwegian Nynorsk": "Норвезька (нюношк)",
      Sindhi: "Сіндхі",
      Sundanese: "Сунданська",
      Yiddish: "Ідиш",
      Yoruba: "Йоруба",
      Javanese: "Яванська",
      Cantonese: "Кантонська",
      Abkhaz: "Абхазька",
      Afar: "Афарська",
      alz: "Алурська",
      ach: "Ачолі",
      awa: "Авадхі",
      Avaric: "Аварська",
      Ewe: "Еве",
      Aymara: "Аймара",
      Irish: "Ірландська",
      Oriya: "Орія",
      Oromo: "Оромо",
      Ossetian: "Осетинська",
      tpi: "Ток-пісін",
      bew: "Бетаві",
      ban: "Балійська",
      btx: "Каро-батакська",
      bbc: "Батакська (тоба)",
      bts: "Батакська (сималунгун)",
      bci: "Бауле",
      Bambara: "Бамбара",
      pag: "Пангасінанська",
      pam: "Пампанганська",
      nso: "Північна сото",
      bem: "Бемба",
      bik: "Бікольська",
      bal: "Белуджська",
      bho: "Бходжпурі",
      bua: "Бурятська",
      chm: "Марійська",
      Chamorro: "Чаморро",
      Chechen: "Чеченська",
      chk: "Чуукська",
      Chuvash: "Чуваська",
      Tswana: "Тсвана",
      Tsonga: "Тсонга",
      "fa-AF": "Дарі",
      shn: "Шанська",
      tet: "Тетум",
      Divehi: "Дівехі",
      dyu: "Дьюла",
      tiv: "Тів",
      din: "Дінка",
      doi: "Догрі",
      "ndc-ZW": "Ндау",
      "South Ndebele": "Південна ндебеле",
      dov: "Донде",
      "bm-Nkoo": "Нко",
      "French(Canada)": "Французька (Канада)",
      Fijian: "Фіджійська",
      fon: "Фон",
      "Western Frisian": "Західнофризька",
      fur: "Фріульська",
      Fulah: "Фула",
      Kongo: "Конго",
      Kalaallisut: "Гренландська",
      gom: "Гоанська конкані",
      Guarani: "Гуарані",
      cnh: "Хака-чін",
      hrx: "Хунсрюкська",
      Kyrgyz: "Киргизька",
      ktu: "Кіту",
      gaa: "Га",
      kac: "Качин",
      Kanuri: "Канурі",
      kha: "Кхасі",
      kek: "Кекчі",
      Komi: "Комі",
      Xhosa: "Коса",
      Corsican: "Корсиканська",
      "crh-Latn": "Кримськотатарська (латиниця)",
      crh: "Кримськотатарська (кирилиця)",
      Quechua: "Кечуа",
      Kurdish: "Курдська (курманджі)",
      ckb: "Курдська (сорані)",
      trp: "Кок-борок",
      ltg: "Латгальська",
      lij: "Лігурійська",
      Limburgish: "Лімбурзька",
      Kirundi: "Кірунді",
      luo: "Луо",
      Luganda: "Луганда",
      Kinyarwanda: "Кіньяруанда",
      lmo: "Ломбардська",
      rom: "Ромська",
      mad: "Мадурська",
      Manx: "Менська",
      mwr: "Марварі",
      "ms-Arab": "Малайська (джаві)",
      Marshallese: "Маршалльська",
      mam: "Мам",
      mai: "Майтхілі",
      mfe: "Маврикійська креольська",
      "mni-Mtei": "Мейтей (маніпурі)",
      min: "Мінангкабау",
      lus: "Мізо",
      hmn: "Хмонг",
      nhe: "Навалтська (східна васахтека)",
      "Southern Sotho": "Південна сото",
      new: "Неварі",
      nus: "Нуер",
      pap: "Папьяменто",
      "pa-Arab": "Панджабі (шахмукхі)",
      "pt-PT": "Португальська (Португалія)",
      Chichewa: "Чичева",
      cgg: "Кіга",
      lua: "Луба-лулуа",
      Akan: "Акан",
      zap: "Сапотекська",
      "Northern Sami": "Північносаамська",
      Samoan: "Самоанська",
      kri: "Кріо",
      crs: "Сейшельська креольська",
      Sango: "Санго",
      "sat-Latn": "Сантальська (латиниця)",
      sat: "Сантальська (ол чікі)",
      Esperanto: "Есперанто",
      Swati: "Свазі",
      "Scottish Gaelic": "Шотландська гельська",
      sus: "Сусу",
      ceb: "Себуанська",
      ber: "Тамазигхт (тифінаг)",
      "ber-Latn": "Тамазигхт",
      Tahitian: "Таїтянська",
      Tonga: "Тонганська",
      Tigrinya: "Тигринья",
      tcy: "Тулу",
      tum: "Тумбука",
      tyv: "Тувинська",
      war: "Варайська",
      mak: "Макасарська",
      vec: "Венеційська",
      Uyghur: "Уйгурська",
      Venda: "Венда",
      Wolof: "Волоф",
      udm: "Удмуртська",
      szl: "Сілезька",
      scn: "Сицилійська",
      hil: "Хілігайнон",
      jam: "Ямайська",
      sah: "Якутська",
      ace: "Ачехська",
      iba: "Ібанська",
      Igbo: "Ігбо",
      ilo: "Ілоканська",
      "iu-Latn": "Інуктитут (латиниця)",
      Inuktitut: "Інуктитут",
      yua: "Юкатанська мая",
      Dzongkha: "Дзонг-ке",
      Zulu: "Зулу"
    },
    notFund: "Не знайдено",
    notFundDesc: "Ми не змогли знайти те, що ви шукаєте.",
    shareTips:
      "Будь-хто з захищеним посиланням може переглядати цю транскрипцію та пов'язані медіафайли.",
    copyLink: "Копіювати посилання",
    copySuccessful: "Успішно скопійовано",
    copyFail: "Помилка копіювання",
    closeTrans: "Скасувати переклад",
    upgradeBtn: "Оновити зараз",
    upgradeTip30: "Цей файл перевищує 30 хвилин.",
    upgradeTipMore:
      "Оновіться до Scribify Pro, щоб транскрибувати файли довжиною до 10 годин",
    errorTips: "Щось пішло не так.",
    copiedLink: "Посилання скопійовано",
    copyGotIt: "знав"
  },
  IdentityInfoManage: {
    or: "або",
    LoginBtn: "Увійти через Email",
    LoginGoogle: "Увійти через Google",
    SignupBtn: "Зареєструватися через Email",
    SignupGoogle: "Зареєструватися через Google",
    SignupDes: "Зареєструйтеся сьогодні та побачте магію — безкоштовно.",
    SignupTitle: "Точна та необмежена транскрипція",
    signup: "Зареєструватися",
    sign_up: "Зареєструватися",
    loginByGoogle: "Увійти через Google",
    emailAddress: "Введіть вашу електронну пошту",
    createAccount: "Створити обліковий запис",
    accountExists: "Вже маєте обліковий запис? ",
    agreeTerm: {
      agree: "Продовжуючи, ви погоджуєтеся з нашими {terms} та {policy}.",
      terms: "Умови",
      policy: "Політикою конфіденційності"
    },
    setPassword: "Встановити пароль",
    code: "Код підтвердження",
    resend: "Відправити повторно",
    enterPassword: "Введіть пароль.",
    passwordLeval: "Надійність пароля",
    Weak: "Слабкий",
    Medium: "Середній",
    Strong: "Сильний",
    confirmPassword: "Підтвердіть пароль",
    invalidEmail: "Невірна адреса електронної пошти",
    logInDirectly: "Обліковий запис вже існує, увійдіть напряму.",
    codeErrorTryAgain: "Неправильний код, спробуйте ще раз.",
    atLeastSix: "Пароль має містити щонайменше 6 символів.",
    passwordNotMatch: "Паролі не співпадають, спробуйте ще раз.",
    login: "Увійти",
    log_in: "Увійти",
    log_In: "Увійти",
    password: "Пароль",
    forgotPassword: "Забули пароль?",
    noAccount: "Немає облікового запису?",
    accountNotExists: "Обліковий запис не існує.",
    passwordError: "Неправильний пароль",
    sendCode: "Надіслати код",
    resetPassword: "Скинути пароль",
    resetYourPassword: "Скинути пароль",
    newOldCantSame: "Новий пароль не може співпадати зі старим.",
    passwordResetOk: "Пароль успішно скинуто!",
    signupToSaveProgress: "Завершіть реєстрацію, щоб зберегти ваш прогрес.",
    tip: "Підказка",
    tipContentEmail:
      "Ми щойно надіслали пароль для входу у ваш обліковий запис на вашу електронну пошту.",
    tipContentPassword:
      "Будь ласка, перевірте вашу поштову скриньку та увійдіть, використовуючи електронну адресу та пароль.",
    codeToEmail:
      "Ми щойно надіслали код підтвердження на вашу електронну пошту. Будь ласка, перевірте свою поштову скриньку та вставте код підтвердження вище."
  },
  Sharepage: {},
  InitPage: {},
  AccountSettingsPage: {
    subscription: "План підписки",
    freeversion: "Безкоштовно",
    transcribeTimesDay: "3 транскрипції на день",
    uploadMinutes: "Завантаження до 30 хвилин",
    lowerPriority: "Нижчий пріоритет",
    currentPlan: "Поточний план",
    professionalEdition: "професійна версія",
    unlimitedTranscription: "Необмежена транскрипція",
    unlimitedNumberOfTimes: "Необмежена частота та тривалість транскрибування.",
    filesUploadedAtOnce:
      "Кожен файл може бути до 10 годин/5 ГБ. Одночасно можна завантажити 50 файлів.",
    highestPriority: "найвищий пріоритет",
    weWillGiveTheHighest:
      "Ми завжди транскрибуємо ваші файли якомога швидше з найвищим пріоритетом.",
    theFirstMonth: "Перший місяць",
    subscribeTo: "підписатися на",
    basicVersionFree: "Базова версія (безкоштовна)",
    return: "Повернутися",
    annualize: "річна",
    monthly: "щомісячна",
    everyYear: "щороку",
    saved: "збережено",
    byTheMonth: "щомісяця",
    firstMonth: "перший місяць",
    afterwardsEveryMonth: "Надалі щомісяця",
    manageSubscription: "Керування підпискою",
    professionalYearbook: "Професійна річна",
    professionalMonthly: "Професійна щомісячна",
    subscriptionWillCancelledOn: "Ваша підписка буде скасована",
    displayLanguage: "Мова інтерфейсу",
    update: "Оновити зараз",
    basicversion: "Базова версія (Безкоштовна)",
    daily: "{start} з {end} щоденних транскрипцій використано",
    upgradetoPro: "Оновити до Pro",
    accountSetting: "Налаштування акаунта",
    logOut: "Вийти",
    account: "Акаунт",
    email: "Електронна пошта",
    id: "ID",
    password: "Пароль",
    resetPassword: "Скинути пароль",
    logIn: "Увійти",
    tryForFree: "Спробувати безкоштовно",
    notFund: "Не знайдено",
    couldntFind: "Ми не змогли знайти те, що ви шукали.",
    proAnnual: "Pro Річна",
    proMonthly: "Pro Щомісячна",
    perMonth: "на місяць",
    afterwards: "після цього",
    accuracy: "точність транскрипції",
    supported: "підтримувані мови",
    identification: "Ідентифікація мовця",
    transcriptSranslation: "Переклад транскрипції",
    perYear: "на рік",
    getProPlan: "Отримати Pro план",
    changeToAnnual: "Змінити на річну",
    automaticRenewalon: "Автоматичне продовження",
    eachMonth: "Автоматичне поновлення {time}-го числа кожного місяця.",
    automaticRenewal:
      "Автоматичне поновлення не вдалося, перевірте спосіб оплати.",
    eachYear: "Автоматичне поновлення {time} кожного року.",
    returnAccountSetting: "Назад",
    needsToWaitLonger:
      "Зачекайте довше, перш ніж ваші файли будуть транскрибовані.",
    freeThreeTimesDay: "Транскрибуйте 3 файли безкоштовно щодня.",
    oneFileUploaded:
      "Кожен файл може тривати до 30 хвилин. Завантажуйте по 1 файлу за раз.",
    uploadWithinHours: "10-годинне завантаження",
      yourSubscription: "Ваша підписка буде скасована {time}."
},
  LanguageMap: {
    sysLanguagesMap: {
      "Chinese(Simplified)": "Китайська (спрощена)",
      "Chinese(Traditional)": "Китайська (традиційна)",
      Japanese: "Японська",
      Danish: "Данська",
      German: "Німецька",
      English: "Англійська",
      Spanish: "Іспанська",
      French: "Французька",
      Italian: "Італійська",
      Hungarian: "Угорська",
      Dutch: "Нідерландська",
      Norwegian: "Норвезька",
      Polish: "Польська",
      Portuguese: "Португальська",
      Finnish: "Фінська",
      Swedish: "Шведська",
      Turkish: "Турецька",
      Greek: "Грецька",
      Russian: "Російська",
      Ukrainian: "Українська",
      Hebrew: "Іврит",
      Arabic: "Арабська",
      Korean: "Корейська"
    }
  },
  demo: {
    title: "NuxtPro",
    description:
      "Шаблон Nuxt3 SaaS з відкритим кодом, попередньо інтегрований з глобальними платіжними шлюзами (Stripe/Cream), Google OAuth, маршрутизацією i18n та інструментами SEO-оптимізації. Розроблений для розробників багатомовних веб-додатків, підтримує SSR/SSG та має виробничий рівень безпеки.",
    startLink: "Почати безкоштовне випробування~",
    thirdPartyLink: "Github →",
    waitlist: {
      cardTitle:
        "Приєднайтеся до списку очікування, щоб першими дізнатися про новини та знижки NuxtPro!",
      placeholder: "Введіть вашу електронну пошту",
      button: "Приєднатися до списку очікування",
      joinCountMessage:
        "🔥 Ранній користувач #{count} щойно приєднався до списку очікування!"
    },
    seo: {
      title: "Шаблон Nuxt SaaS з відкритим кодом | NuxtPro",
      description:
        "Шаблон NuxtJS, що містить все необхідне для швидкого виведення вашого продукту на ринок. Від ідеї до виробництва за 5 хвилин."
    },
    api: {
      title: "Це демонстрація",
      corpInfo: "Інформація про компанію"
    }
  },
  videoLang: {
    ERROR_TYPES: {
      network: {
        code: 1,
        msg: "Помилка завантаження відео"
      },
      mse: {
        code: 2,
        msg: "Помилка додавання потоку"
      },
      parse: {
        code: 3,
        msg: "Помилка аналізу"
      },
      format: {
        code: 4,
        msg: "Помилка формату"
      },
      decoder: {
        code: 5,
        msg: "Помилка декодування"
      },
      runtime: {
        code: 6,
        msg: "Синтаксична помилка"
      },
      timeout: {
        code: 7,
        msg: "Час відтворення вичерпано"
      },
      other: {
        code: 8,
        msg: "Інша помилка"
      }
    },
    HAVE_NOTHING: "Немає інформації про готовність аудіо/відео",
    HAVE_METADATA: "Метадані аудіо/відео готові",
    HAVE_CURRENT_DATA:
      "Дані про поточну позицію відтворення доступні, але недостатньо для відтворення наступного кадру/мілісекунди",
    HAVE_FUTURE_DATA:
      "Поточні дані та дані принаймні для наступного кадру доступні",
    HAVE_ENOUGH_DATA: "Достатньо даних для початку відтворення",
    NETWORK_EMPTY: "Аудіо/відео ще не ініціалізовано",
    NETWORK_IDLE:
      "Аудіо/відео активне і вибрано ресурс, але мережа не використовується",
    NETWORK_LOADING: "Браузер завантажує дані",
    NETWORK_NO_SOURCE: "Джерело аудіо/відео не знайдено",
    MEDIA_ERR_ABORTED: "Процес отримання перервано користувачем",
    MEDIA_ERR_NETWORK: "Мережева помилка",
    MEDIA_ERR_DECODE: "Помилка декодування",
    MEDIA_ERR_SRC_NOT_SUPPORTED: "Непідтримуваний формат аудіо/відео",
    REPLAY: "Повторити",
    ERROR: "Здається, виникла проблема з мережевим з'єднанням",
    PLAY_TIPS: "Відтворити",
    PAUSE_TIPS: "Пауза",
    PLAYNEXT_TIPS: "Наступна серія",
    DOWNLOAD_TIPS: "Завантажити",
    ROTATE_TIPS: "Обертати",
    RELOAD_TIPS: "Перезавантажити",
    FULLSCREEN_TIPS: "Повноекранний режим",
    EXITFULLSCREEN_TIPS: "Вийти з повноекранного режиму",
    CSSFULLSCREEN_TIPS: "Увійти в CSS-повноекранний режим",
    EXITCSSFULLSCREEN_TIPS: "Вийти з CSS-повноекранного режиму",
    TEXTTRACK: "Субтитри",
    PIP: "Картинка в картинці",
    SCREENSHOT: "Знімок екрану",
    LIVE: "Пряма трансляція",
    OFF: "Вимкнено",
    OPEN: "Увімкнено",
    MINI_DRAG: "Натисніть та утримуйте для переміщення відео",
    MINISCREEN: "Малий екран",
    REFRESH_TIPS: "Спробуйте",
    REFRESH: "Оновити",
    FORWARD: "Перемотування вперед",
    LIVE_TIP: "Наживо",
    TM_SUBTITLE_SHOW_TIPS: "Увімкнути субтитри",
    TM_SUBTITLE_HIDE_TIPS: "Вимкнути субтитри",
    TM_MINIMIZE_TIPS: "Приховати відео"
  },
  privacyPolicy: {
    privacyPolicyTitle: "Політика конфіденційності",
    lastUpdated: "Останнє оновлення: 25 серпня 2025 р.",
    policyDescription:
      "Ця Політика описує, як Scribify (далі – «Scribify», «наш», «ми») збирає, використовує та розкриває вашу особисту інформацію, коли ви користуєтеся нашими послугами, веб-сайтами",
    websiteLink: "(https://www.scribify.ai/)",
    servicesDefinition: "та програмне забезпечення (разом – «Послуги»).",
    policyAgreement:
      "Будь ласка, уважно прочитайте цю Політику конфіденційності та переконайтеся, що ви її розумієте. Використовуючи будь-який з наших Сервісів, ви погоджуєтеся з цією Політикою конфіденційності. Якщо ви не погоджуєтеся на використання нами ваших персональних даних відповідно до цієї Політики, ви повинні негайно припинити користуватися нашими Сервісами.",
    policyOverview:
      "У цій політиці ми викладаємо: які дані ми збираємо та чому; як обробляються ваші дані; та ваші права щодо ваших даних. Ми не продаємо ваші дані.",
    scopeTitle: "1. Сфера застосування цієї Політики конфіденційності",
    whatWeCollectTitle: "2. Що ми збираємо та чому",
    accessShareTitle:
      "3. Коли ми отримуємо доступ до вашої інформації або ділимося нею",
    secureDataTitle: "4. Як ми захищаємо ваші дані",
    deleteContentTitle: "5. Що відбувається, коли ви видаляєте свій контент",
    locationTitle: "6. Розташування сайту та даних",
    childrenPrivacyTitle: "7. Конфіденційність дітей",
    updatesTitle: "8. Оновлення цієї Політики конфіденційності",
    contactUsTitle: "9. Зв&#39;яжіться з нами",
    identityAccessTitle: "2.1 Ідентифікація та доступ",
    billingInfoTitle: "2.2 Платіжна інформація",
    productInteractionsTitle: "2.3 Взаємодія продуктів",
    websiteInteractionsTitle: "2.4 Взаємодія з веб-сайтом",
    cookiesTitle: "2.5 Файли cookie",
    voluntaryCorrespondenceTitle: "2.6 Добровільне листування",
    scopeContent:
      "Ця Політика конфіденційності застосовується лише до збору та обробки нами інформації про користувачів Сервісів. Ця Політика конфіденційності не поширюється на будь-які сервіси, веб-сайти чи програмне забезпечення, що експлуатуються третіми сторонами, на які пов’язані посилання (незалежно від того, чи надаємо ми ці посилання, чи інші користувачі діляться ними), а також на контент, дані, програми чи матеріали третіх сторін. Ми радимо вам перевірити політику конфіденційності будь-якого веб-сайту чи програмного забезпечення третіх сторін, перш ніж надавати їм будь-яку інформацію.",
    collectPrinciple:
      "Нашим керівним принципом є збирати лише те, що нам потрібно. Ось що це означає на практиці:",
    identityAccessContent:
      "Коли ви реєструєтесь в одному з наших продуктів, ми запитуємо ідентифікаційну інформацію, таку як ваше ім&#39;я, адреса електронної пошти. Це необхідно для забезпечення основної функціональності продукту та для того, щоб ми могли надсилати вам оновлення продуктів та іншу важливу інформацію.",
    billingInfoContent:
      "Якщо ви зареєструєтесь для отримання платного продукту, вам буде запропоновано надати платіжну інформацію та платіжну адресу. Платіжна інформація надсилається безпосередньо до нашого платіжного процесора та не потрапляє на наші сервери.",
    productInteractionsContent:
      "Ми зберігаємо на наших серверах контент, який ви завантажуєте, отримуєте або зберігаєте у своїх облікових записах продуктів. Якщо ви не видалите цей контент, ми можемо зберігати його, поки ваш обліковий запис активний.",
    websiteInteractionsContent:
      "Ми збираємо інформацію про вашу активність у веб-перегляді для аналітичних та статистичних цілей, таких як тестування коефіцієнта конверсії та експерименти з новими дизайнами продуктів. Це включає, наприклад, версії вашого браузера та операційної системи, вашу IP-адресу, які веб-сторінки ви відвідували та скільки часу вони завантажувалися, а також який веб-сайт перенаправив вас до нас. Якщо у вас є обліковий запис і ви ввійшли в систему, ці дані веб-аналітики пов’язуються з вашою IP-адресою та обліковим записом користувача, доки ваш обліковий запис не стане активним.",
    cookiesContent1:
      "Ми також використовуємо постійні файли cookie першої сторони та деякі сторонні файли cookie для зберігання певних налаштувань, полегшення використання наших програм, проведення A/B-тестування та підтримки деяких аналітичних даних.",
    cookiesContent2:
      "Файл cookie – це фрагмент тексту, який зберігається вашим браузером. Він може допомогти запам’ятати інформацію для входу та налаштування сайту. Він також може збирати таку інформацію, як тип вашого браузера, операційна система, відвідані веб-сторінки, тривалість відвідування, переглянутий контент та інші дані про кліки. Ви можете налаштувати параметри збереження файлів cookie та прийняти або заблокувати окремі файли cookie в налаштуваннях вашого браузера, хоча наші програми не працюватимуть, а інші аспекти нашого сервісу можуть не працювати належним чином, якщо ви вимкнете файли cookie.",
    voluntaryCorrespondenceContent:
      "Коли ви надсилаєте нам електронного листа з питанням або просите про допомогу, ми зберігаємо це листування, включаючи вашу адресу електронної пошти, щоб мати історію минулого листування, до якої можна було б звернутися, якщо ви звернетеся до нас у майбутньому.",
    accessShareContent1:
      "Щоб надавати продукти або послуги, які ви замовили. Ми використовуємо деяких сторонніх субпідрядників для роботи наших програм і надання вам Послуг. Це включає постачальників хмарних послуг та аналітики.",
    accessShareContent2:
      "Для розслідування, запобігання або вжиття заходів щодо зловживань. Доступ до облікового запису клієнта під час розслідування потенційного зловживання є крайнім заходом. Ми хочемо захистити конфіденційність та безпеку як наших клієнтів, так і людей, які повідомляють нам про проблеми, і ми робимо все можливе, щоб збалансувати ці обов&#39;язки протягом усього процесу. Якщо ми виявимо, що ви використовуєте наші продукти для обмеженої мети, ми вживемо необхідних заходів, включаючи повідомлення відповідних органів, де це обґрунтовано.",
    accessShareContent3: "Коли це вимагається чинним законодавством.",
    userDataRequests:
      "- Запити на дані користувачів. Наша політика полягає в тому, щоб не відповідати на запити уряду щодо даних користувачів, окрім випадків, коли нас зобов&#39;язує це судовий процес або за певних обставин, у разі надзвичайного запиту. Однак, якщо правоохоронні органи США мають необхідний ордер, повістку до суду або судове рішення, що вимагає від нас надання даних, ми повинні їх виконати. Так само ми відповідатимемо на запити від урядових органів за межами США лише за умови, що нас зобов&#39;язує уряд США відповідно до процедур, викладених у договорі або угоді про взаємну правову допомогу. Наша політика полягає в тому, щоб повідомляти постраждалих користувачів, перш ніж ми надаватимемо дані, окрім випадків, коли це заборонено законом, та за винятком деяких надзвичайних випадків.",
    preservationRequests:
      "- Запити на збереження. Аналогічно, наша політика полягає в тому, щоб виконувати запити на збереження даних лише у випадках, передбачених Законом США про збережені федеральні комунікації, розділ 2703(f) розділу 18 Кодексу законів США, або належним чином врученою судовою повісткою США у цивільних справах. Ми не передаємо збережені дані, окрім випадків, передбачених законом або судовим наказом, який ми вирішили не оскаржувати. Крім того, якщо ми не отримаємо належного ордера, судового наказу або судової повістки до закінчення необхідного терміну зберігання, ми знищимо будь-які збережені копії даних клієнтів після закінчення терміну зберігання.",
    taxAudit:
      "- Якщо нас перевірятиме податковий орган, ми можемо бути зобов&#39;язані надати інформацію, пов&#39;язану з виставленням рахунків. У такому разі ми поділимося лише необхідною інформацією, такою як адреси для виставлення рахунків та інформація про звільнення від сплати податків.",
    secureDataContent1: "Усі дані шифруються через",
    sslTlsLink: "SSL/TLS",
    secureDataContent2:
      "коли вони передаються з наших серверів до вашого браузера.",
    deleteContentContent:
      "Якщо ви видалите будь-який контент, він одразу стане недоступним.",
    locationContent:
      "Наші продукти та інші веб-ресурси працюють у Сполучених Штатах. Якщо ви знаходитесь у Європейському Союзі, Великій Британії або будь-якому іншому місці за межами Сполучених Штатів, будь ласка, майте на увазі, що будь-яка інформація, яку ви нам надаєте, буде передана до Сполучених Штатів та зберігатиметься там. Використовуючи наші веб-сайти або Сервіси та/або надаючи нам свою особисту інформацію, ви погоджуєтеся на цю передачу.",
    childrenPrivacyContent:
      "Сервіси не призначені для дітей, і ми свідомо не збираємо Персональну інформацію від дітей віком до 13 років. Якщо вам ще не виповнилося 13 років, будь ласка, не надсилайте жодної особистої інформації через Сервіси. Якщо ви вважаєте, що дитина надала нам Персональну інформацію з порушенням цієї Політики, будь ласка, зв’яжіться з нами, як зазначено нижче.",
    updatesContent:
      "Ми можемо оновлювати цю політику за потреби, щоб відповідати чинним нормам та відображати будь-які нові практики. Щоразу, коли ми внесемо суттєві зміни до нашої політики, ми оновлюватимемо дату у верхній частині цієї сторінки.",
    contactUsContent1:
      "Якщо у вас є будь-які запитання, коментарі чи скарги щодо нашої Політики конфіденційності, будь ласка",
    contactUs: "зв&#39;яжіться з нами",
    contactUsContent2:
      "і ми докладемо всіх зусиль, щоб розглянути вашу скаргу якомога швидше."
  },
  termsOfService: {
    termsOfServiceTitle: "Умови надання послуг",
    lastUpdated: "Останнє оновлення: 21 вересня 2022 р.",
    thankYouMessage: "Дякуємо, що користуєтеся нашою продукцією!",
    companyReference:
      "Коли ми кажемо «Компанія», «ми», «наш» або «нас» у цьому документі, ми маємо на увазі Scribify.",
    servicesDefinition:
      "Коли ми кажемо «Сервіси», ми маємо на увазі будь-який продукт, створений та підтримуваний Scribify, незалежно від того, чи надається він у веббраузері, настільному додатку, мобільному додатку чи іншому форматі.",
    termsUpdateNotice:
      "Ми можемо оновлювати ці Умови надання послуг у майбутньому. Зазвичай ці зміни полягали в тому, щоб уточнити деякі з цих умов шляхом посилання на розширену пов’язану політику. Щоразу, коли ми вносимо суттєві зміни до наших політик, ми оновлюватимемо дату у верхній частині цієї сторінки та вживатимемо будь-яких інших відповідних заходів для повідомлення власників облікових записів.",
    acceptanceOfAgreementTitle: "1. Прийняття Угоди",
    scribifyServicesTitle: "2. Послуги Scribify",
    accountTermsTitle: "3. Умови облікового запису",
    paymentRefundsTitle: "4. Оплата, повернення коштів та зміни плану",
    cancellationTerminationTitle: "5. Скасування та розірвання",
    submissionsTitle: "6. Подання матеріалів",
    uptimeSecurityTitle: "7. Безперебійність та безпека",
    siteManagementTitle: "8. Управління сайтом",
    copyrightContentTitle: "9. Авторське право та право власності на контент",
    prohibitedActivitiesTitle: "10. Заборонені види діяльності",
    featuresBugsTitle: "11. Функції та помилки",
    correctionsTitle: "12. ВИПРАВЛЕННЯ",
    userDataTitle: "13. Дані користувача",
    privacyPolicyTitle: "14. Політика конфіденційності",
    liabilityTitle: "15. Відповідальність",
    miscellaneousTitle: "16. Різне",
    contactUsTitle: "17. Зв&#39;яжіться з нами",
    acceptanceContent1:
      "Користуючись нашими Сервісами, ви підтверджуєте свою згоду з цією Угодою, яка тим самим стає обов&#39;язковим договором між вами та Scribify. Ви підтверджуєте, що маєте законне право прийняти ці Умови, та підтверджуєте, що досягли повноліття для укладання обов&#39;язкового договору. Прийняття Scribify прямо обумовлене вашою згодою з усіма умовами цієї Угоди.",
    acceptanceContent2:
      "Сервіси не призначені для осіб віком до 18 років і не повинні використовуватися такими особами. Користуючись Сервісами, ви підтверджуєте та гарантуєте, що відповідаєте вищезазначеним вимогам.",
    acceptanceContent3:
      "Терміни «ви», «ваш», «ви самі» також включають ваших співробітників, агентів, представників бізнесу та будь-яких інших осіб, яким ви надаєте доступ до Послуг через свій Обліковий запис (як визначено нижче). Ви несете відповідальність за те, щоб усі особи, які отримують доступ до Послуг через ваш обліковий запис, знали про ці Умови та дотримувалися їх.",
    acceptanceContent4:
      "Scribify залишає за собою право час від часу переглядати та оновлювати ці Умови на власний розсуд. Усі зміни набувають чинності негайно після публікації. Ваше подальше використання Сервісів після публікації переглянутих Умов означає, що ви приймаєте та погоджуєтеся зі змінами. Очікується, що ви час від часу перевірятимете цю сторінку, щоб бути в курсі будь-яких змін, оскільки вони є обов&#39;язковими для вас.",
    servicesContent1:
      "Наші Сервіси дозволяють користувачам перетворювати голосові розмови на транскрибований текст, який можна шукати, перекладати та ділитися ним з іншими.",
    servicesContent2:
      "Ви можете обрати, чи користуватися безкоштовною версією Послуг («Безкоштовні послуги»), чи платною версією Послуг на основі підписки, за яку вам може знадобитися сплатити комісію («Платні послуги»).",
    servicesContent3:
      "Ми надамо вам доступ до Послуг. Ви несете відповідальність за вжиття всіх необхідних заходів для отримання доступу до Послуг.",
    accountTerms1:
      "- Ви несете відповідальність за забезпечення безпеки свого облікового запису. Компанія не може і не нестиме відповідальності за будь-які збитки чи шкоду, спричинені вами невиконанням цього зобов&#39;язання щодо безпеки.",
    accountTerms2:
      "- Ви не маєте права використовувати Сервіси для будь-яких незаконних, неетичних або аморальних цілей.",
    accountTerms3:
      "- Ви несете відповідальність за весь опублікований контент та дії, що відбуваються під вашим обліковим записом. Це включає контент, опублікований іншими особами, які: (а) мають доступ до ваших облікових даних для входу; або (б) мають власні дані для входу під вашим обліковим записом.",
    accountTerms4:
      "- Ви маєте бути людиною. Облікові записи, зареєстровані &quot;ботами&quot; або іншими автоматизованими методами, заборонені.",
    paymentContent1:
      "– Для платних Сервісів, які пропонують безкоштовний пробний період, ми пояснюємо тривалість пробного періоду під час реєстрації. Після пробного періоду вам потрібно буде сплатити авансом, щоб продовжувати користуватися Сервісом. Якщо ви не сплатите, ці послуги припиняться.",
    paymentContent2:
      "– Якщо ви переходите з безкоштовного плану на платний, ми негайно знімемо кошти з вашої картки, а ваш платіжний цикл почнеться з дня оновлення.",
    paymentContent3:
      "- Усі збори не включають жодних податків, зборів чи мит, що стягуються податковими органами. За потреби ми стягуватимемо ці податки від імені податкового органу та перераховуватимемо їх податковим органам. В іншому випадку ви несете відповідальність за сплату всіх податків, зборів чи мит.",
    paymentContent4:
      "- Усі покупки не підлягають поверненню коштів. Ви можете скасувати будь-які платні послуги будь-коли, увійшовши до свого облікового запису. Для платних підписок скасування набуде чинності після закінчення поточного оплаченого терміну, якщо не зазначено інше.",
    cancellationContent1:
      "- Якщо ви скасуєте Послугу до закінчення будь-якого оплаченого періоду, ваше скасування набуде чинності негайно, і з вас більше не стягуватиметься плата. Ми не автоматично перераховуємо невикористаний час за останній розрахунковий цикл.",
    cancellationContent2:
      "- Ми маємо право призупинити або закрити ваш обліковий запис і відмовити в будь-якому поточному або майбутньому використанні наших Сервісів з будь-якої причини в будь-який час. Призупинення означає, що ви не зможете отримати доступ до облікового запису або будь-якого його вмісту. Призупинення також призведе до видалення вашого облікового запису або вашого доступу до нього, а також до втрати та відмови від усього вмісту вашого облікового запису. Ми також залишаємо за собою право відмовити у використанні Сервісів будь-кому з будь-якої причини в будь-який час. Це положення діє тому, що, статистично кажучи, із сотень тисяч облікових записів у наших Сервісах принаймні один робить щось неправомірне.",
    cancellationContent3:
      "- Усні, фізичні, письмові або інші образи (включаючи погрози образами або помстою) щодо співробітника або посадової особи Компанії можуть призвести до негайного закриття облікового запису.",
    submissionsContent:
      "Ви визнаєте та погоджуєтеся з тим, що будь-які запитання, коментарі, пропозиції, ідеї, відгуки чи інша інформація щодо Сайту («Матеріали»), надані вами нам, не є конфіденційними та стають нашою виключною власністю. Ми володіємо виключними правами, включаючи всі права інтелектуальної власності, та маємо право на необмежене використання та поширення цих Матеріалів для будь-яких законних цілей, комерційних чи інших, без підтвердження або компенсації вам. Ви цим відмовляєтеся від усіх моральних прав на будь-які такі Матеріали та гарантуєте, що будь-які такі Матеріали є оригінальними та належать вам або що ви маєте право подавати такі Матеріали. Ви погоджуєтеся, що до нас не буде жодних претензій за будь-яке ймовірне або фактичне порушення або незаконне привласнення будь-якого права власності на ваші Матеріали.",
    uptimeContent1:
      "– Ви користуєтеся Послугами на свій власний ризик. Ми надаємо ці Послуги на умовах «як є» та «як доступно». Ми не пропонуємо угод про рівень обслуговування для більшості наших Послуг, але серйозно ставимося до часу безвідмовної роботи наших програм.",
    uptimeContent2:
      "- Ми залишаємо за собою право тимчасово заблокувати ваш обліковий запис, якщо ваше використання значно перевищує типове використання іншими клієнтами Сервісів. Звичайно, ми зв’яжемося з вами, перш ніж вживати будь-яких заходів, за винятком рідкісних випадків, коли рівень використання може негативно вплинути на продуктивність Сервісу для інших клієнтів.",
    uptimeContent3:
      "- Ми вживаємо багато заходів для захисту та безпеки ваших даних за допомогою резервного копіювання, резервування та шифрування. Ми застосовуємо шифрування для передачі даних через загальнодоступний Інтернет.",
    uptimeContent4:
      "- Ми використовуємо сторонніх постачальників та хостинг-партнерів для надання необхідного обладнання, програмного забезпечення, мережевих ресурсів, сховищ та супутніх технологій, необхідних для роботи Сервісів.",
    siteManagementContent:
      "Ми залишаємо за собою право, але не зобов&#39;язання: (1) контролювати Сайт на наявність порушень цих Умов обслуговування; (2) вживати відповідних правових заходів проти будь-кого, хто, на наш власний розсуд, порушує закон або ці Умови обслуговування, включаючи, без обмежень, повідомлення про такого користувача правоохоронним органам; (3) на наш власний розсуд та без обмежень, відмовити, обмежити доступ, обмежити доступність або відключити (наскільки це технологічно можливо) будь-який з ваших Внесків або будь-яку їх частину; (4) на наш власний розсуд та без обмежень, повідомлення чи відповідальності, видалити з Сайту або іншим чином відключити всі файли та контент, які є надмірними за розміром або будь-яким чином обтяжують наші системи; та (5) іншим чином керувати Сайтом таким чином, щоб захистити наші права та власність і сприяти належному функціонуванню Сайту.",
    copyrightContent1:
      "- Весь контент, розміщений у Сервісах, має відповідати законодавству США про авторське право.",
    copyrightContent2:
      "- Ми не претендуємо на жодні права інтелектуальної власності на матеріали, які ви надаєте Сервісам. Усі завантажені матеріали залишаються вашими.",
    copyrightContent3:
      "- Ми не перевіряємо контент попередньо, але залишаємо за собою право (але не зобов&#39;язання) на власний розсуд відмовити у доступі або видалити будь-який контент, доступний через Сервіс.",
    copyrightContent4:
      "- Назви, зовнішній вигляд та функціональність Сервісів є власністю Компанії. Усі права захищено. Ви не можете дублювати, копіювати або повторно використовувати будь-яку частину HTML, CSS, JavaScript або елементів візуального дизайну без письмового дозволу Компанії. Ви повинні запросити дозвіл на використання логотипу Компанії або будь-яких логотипів Сервісу в рекламних цілях. Будь ласка",
    emailUs: "напишіть нам на електронну пошту",
    copyrightContent5:
      "запити на використання логотипів. Ми залишаємо за собою право скасувати цей дозвіл, якщо ви порушите ці Умови надання послуг.",
    copyrightContent6:
      "- Ви погоджуєтеся не відтворювати, не дублювати, не копіювати, не продавати, не перепродавати та не використовувати будь-яку частину Послуг, використання Послуг або доступ до Послуг без явного письмового дозволу Компанії.",
    copyrightContent7:
      "- Ви не повинні змінювати інший веб-сайт таким чином, щоб створити хибне враження, що він пов&#39;язаний із Послугами або Компанією.",
    copyrightContent8:
      "- Ми поважаємо права інтелектуальної власності інших осіб. Якщо ви вважаєте, що будь-який матеріал, доступний на Сайті або через нього, порушує будь-які авторські права, якими ви володієте або контролюєте, будь ласка, негайно",
    contactUs: "зв&#39;яжіться з нами",
    copyrightContent9:
      "Копію вашого Повідомлення буде надіслано особі, яка розмістила або зберегла матеріал, зазначений у Повідомленні. Зверніть увагу, що відповідно до чинного законодавства ви можете нести відповідальність за збитки, якщо ви надасте суттєві неправдиві заяви в Повідомленні. Таким чином, якщо ви не впевнені, що матеріал, розташований на Сайті або на який є посилання, порушує ваші авторські права, вам слід спочатку звернутися до адвоката.",
    prohibitedActivitiesIntro:
      "Ви не маєте права отримувати доступ до Сайту або використовувати його для будь-яких цілей, окрім тих, для яких ми надаємо Сайт. Сайт не може використовуватися у зв&#39;язку з будь-якими комерційними починаннями, окрім тих, які спеціально схвалені або затверджені нами.",
    prohibitedActivitiesUserAgreement:
      "Як користувач Сайту, ви погоджуєтеся не:",
    prohibitedActivity1:
      "- Систематично отримувати дані або інший контент із Сайту для створення або компіляції, прямо чи опосередковано, колекції, збірки, бази даних або каталогу без нашого письмового дозволу.",
    prohibitedActivity2:
      "- Обманювати, шахраювати або вводити в оману нас та інших користувачів, особливо в будь-якій спробі дізнатися конфіденційну інформацію облікового запису, таку як паролі користувачів.",
    prohibitedActivity3:
      "- Обходити, вимикати або іншим чином втручатися у функції безпеки Сайту, включаючи функції, що запобігають або обмежують використання чи копіювання будь-якого Контенту, або встановлюють обмеження на використання Сайту та/або Контенту, що міститься на ньому.",
    prohibitedActivity4:
      "- Зневажати, очорнювати або іншим чином завдавати шкоди, на нашу думку, нам та/або Сайту.",
    prohibitedActivity5:
      "- Використовувати будь-яку інформацію, отриману з Сайту, з метою переслідування, зловживань або завдання шкоди іншій особі.",
    prohibitedActivity6:
      "- Неналежним чином використовувати наші служби підтримки або подавати неправдиві повідомлення про зловживання чи неправомірні дії.",
    prohibitedActivity7:
      "- Використовувати Сайт способом, що не відповідає будь-яким чинним законам або нормативним актам.",
    prohibitedActivity8:
      "- Займатися несанкціонованим фреймуванням або розміщенням посилань на Сайт.",
    prohibitedActivity9:
      "- Завантажувати або передавати (або намагатися завантажити чи передавати) віруси, троянських коней чи інші матеріали, включаючи надмірне використання великих літер та спам (безперервне розміщення повторюваного тексту), які перешкоджають безперебійному використанню та користуванню Сайтом будь-якою стороною або змінюють, погіршують, порушують, змінюють або перешкоджають використанню, функціям, можливостям, роботі чи обслуговуванню Сайту.",
    prohibitedActivity10:
      "- Займатися будь-яким автоматизованим використанням системи, таким як використання скриптів для надсилання коментарів або повідомлень, або використання будь-яких інструментів для збору та вилучення даних, роботів чи аналогічних інструментів для збору та вилучення даних.",
    prohibitedActivity11:
      "- Видаліть повідомлення про авторські права або інші права власності з будь-якого Контенту.",
    prohibitedActivity12:
      "- Намагатися видати себе за іншого користувача чи особу, або використовувати ім&#39;я користувача іншого користувача.",
    prohibitedActivity13:
      "- Завантажувати або передавати (або намагатися завантажити або передавати) будь-які матеріали, що діють як пасивний або активний механізм збору чи передачі інформації, включаючи, без обмежень, формати обміну чіткою графікою («gif»), пікселі 1×1, веб-жучки, файли cookie або інші подібні пристрої (іноді їх називають «шпигунськими програмами» або «механізмами пасивного збору» або «pcms»).",
    prohibitedActivity14:
      "- Втручатися, порушувати роботу Сайту або мереж чи сервісів, підключених до Сайту, створювати надмірне навантаження на них або на них.",
    prohibitedActivity15:
      "- Переслідувати, дратувати, залякувати або погрожувати будь-кому з наших співробітників чи агентів, які займаються наданням вам будь-якої частини Сайту.",
    prohibitedActivity16:
      "- Намагатися обійти будь-які заходи Сайту, спрямовані на запобігання або обмеження доступу до Сайту або будь-якої його частини.",
    prohibitedActivity17:
      "- Копіювати або адаптувати програмне забезпечення Сайту, включаючи, але не обмежуючись, Flash, PHP, HTML, JavaScript або інший код.",
    prohibitedActivity18:
      "- За винятком випадків, дозволених чинним законодавством, розшифровувати, декомпілювати, дизасемблювати або здійснювати зворотне проектування будь-якого програмного забезпечення, що містить або будь-яким чином є частиною Сайту.",
    prohibitedActivity19:
      "- За винятком випадків, коли це може бути результатом використання стандартної пошукової системи або інтернет-браузера, використовувати, запускати, розробляти або розповсюджувати будь-яку автоматизовану систему, включаючи, без обмежень, будь-якого павука, робота, утиліту для читерства, парсера або офлайн-читача, який отримує доступ до Сайту, або використовувати чи запускати будь-який неавторизований скрипт чи інше програмне забезпечення.",
    prohibitedActivity20:
      "- Використовувати агента з закупівель або агента з закупівель для здійснення покупок на Сайті.",
    prohibitedActivity21:
      "- Здійснювати будь-яке несанкціоноване використання Сайту, включаючи збір імен користувачів та/або адрес електронної пошти користувачів електронними або іншими засобами з метою надсилання небажаної електронної пошти, або створення облікових записів користувачів автоматизованими засобами або під неправдивим приводом.",
    prohibitedActivity22:
      "- Використовувати Сайт як частину будь-яких зусиль, спрямованих на конкуренцію з нами, або іншим чином використовувати Сайт та/або Контент для будь-якої прибуткової діяльності чи комерційного підприємництва.",
    prohibitedActivity23:
      "- Використовувати Сайт для реклами або пропозиції продажу товарів та послуг.",
    prohibitedActivity24:
      "- Продавати або іншим чином передавати свій профіль.",
    featuresContent1:
      "Ми ретельно розробляємо наші Послуги, спираючись на власний досвід та досвід клієнтів, які діляться своїм часом і відгуками. Однак не існує такого поняття, як сервіс, який би сподобався всім. Ми не гарантуємо, що наші Послуги відповідатимуть вашим конкретним вимогам чи очікуванням.",
    featuresContent2:
      "Ми також тестуємо всі наші функції перед їх постачанням. Як і будь-яке програмне забезпечення, наші Сервіси неминуче містять деякі помилки. Ми відстежуємо помилки, про які нам повідомляють, і працюємо над ними, особливо ті, що стосуються безпеки чи конфіденційності. Не всі повідомлені помилки будуть виправлені, і ми не гарантуємо повну безпомилковість Сервісів.",
    correctionsContent1:
      "На Сайті може бути інформація, яка містить друкарські помилки, неточності або пропуски, включаючи описи, ціни, наявність та різну іншу інформацію. Ми залишаємо за собою право виправляти будь-які помилки, неточності або пропуски, а також змінювати або оновлювати інформацію на Сайті в будь-який час без попереднього повідомлення.",
    correctionsContent2:
      "Ми не можемо гарантувати, що Сайт буде доступним у будь-який час. У нас можуть виникнути проблеми з обладнанням, програмним забезпеченням або інші проблеми, або нам може знадобитися виконати технічне обслуговування, пов&#39;язане з Сайтом, що призведе до перебоїв у роботі, затримок або помилок. Ми залишаємо за собою право змінювати, переглядати, оновлювати, призупиняти, припиняти або іншим чином модифікувати Сайт у будь-який час або з будь-якої причини без попередження. Ви погоджуєтеся з тим, що ми не несемо жодної відповідальності за будь-які втрати, пошкодження або незручності, спричинені вашою неможливістю доступу до Сайту або його використання під час будь-якого простою або припинення роботи Сайту. Ніщо в цих Умовах обслуговування не буде тлумачитися як зобов&#39;язання для нас підтримувати Сайт або надавати будь-які виправлення, оновлення або релізи, пов&#39;язані з цим.",
    userDataContent:
      "Ми зберігатимемо певні дані, які ви передаєте на Сайт, з метою управління продуктивністю Сайту, а також дані, що стосуються вашого використання Сайту. Хоча ми регулярно створюємо резервні копії даних, ви несете повну відповідальність за всі дані, які ви передаєте або які стосуються будь-якої діяльності, яку ви здійснили за допомогою Сайту. Ви погоджуєтеся з тим, що ми не несемо відповідальності перед вами за будь-яку втрату або пошкодження будь-яких таких даних, і ви цим відмовляєтеся від будь-якого права на позов проти нас, що виникає внаслідок такої втрати або пошкодження таких даних.",
    privacyPolicyContent1:
      "Ми дбаємо про конфіденційність та безпеку даних. Будь ласка, ознайомтеся з нашими",
    privacyPolicy: "Політика конфіденційності",
    privacyPolicyContent2:
      "Використовуючи Сайт, ви погоджуєтеся з нашою Політикою конфіденційності, яка включена до цих Умов обслуговування. Зверніть увагу, що Сайт розміщено у Сполучених Штатах. Якщо ви заходите на Сайт з будь-якого іншого регіону світу, де діють закони чи інші вимоги, що регулюють збір, використання або розкриття персональних даних, що відрізняються від чинного законодавства у Сполучених Штатах, то, продовжуючи користуватися Сайтом, ви передаєте свої дані до Сполучених Штатів, і ви погоджуєтеся на передачу та обробку ваших даних у Сполучених Штатах.",
    liabilityIntro:
      "Ми згадуємо про відповідальність у цих Умовах, але щоб викласти все це в одному розділі:",
    liabilityContent:
      "Ви чітко розумієте та погоджуєтеся з тим, що Компанія не несе відповідальності, за законом або за правом справедливості, перед вами або будь-якою третьою стороною за будь-які прямі, непрямі, випадкові, втрачені прибутки, спеціальні, побічні, штрафні або штрафні збитки, включаючи, але не обмежуючись, збитки за втрату прибутку, репутації, використання, даних або інші нематеріальні збитки (навіть якщо Компанія була повідомлена про можливість таких збитків), що виникли внаслідок: (1) використання або неможливості використання Сервісів; (2) помилок, неточностей або неточностей контенту та матеріалів; (3) тілесних ушкоджень або пошкодження майна будь-якого характеру, що виникли внаслідок вашого доступу до сайту та його використання; (4) вартості придбання товарів та послуг-замінників, що виникли в результаті будь-яких товарів, даних, інформації або послуг, придбаних або отриманих, або отриманих повідомлень чи транзакцій, здійснених через Сервіси або з них; (5) будь-якого несанкціонованого доступу до наших захищених серверів або їх використання та/або будь-якої та всієї особистої інформації та/або фінансової інформації, що зберігається на них; (6) будь-якого переривання або припинення передачі на сайт або з нього; (7) будь-які помилки, віруси, троянські програми тощо, які можуть бути передані на сайт або через нього будь-якою третьою стороною, та/або; (8) будь-які помилки або упущення в будь-якому контенті та матеріалах або за будь-які збитки чи шкоду будь-якого роду, понесені в результаті використання будь-якого контенту, розміщеного, переданого або іншим чином наданого через сайт; (9) заяви або поведінку будь-якої третьої сторони в сервісі; (10) або будь-яке інше питання, що стосується цих Умов обслуговування або Сервісів, незалежно від того, чи це порушення договору, делікт (включаючи недбалість, активну чи пасивну), чи будь-яка інша теорія відповідальності.",
    miscellaneousContent:
      "Ці Умови надання послуг та будь-які політики чи правила роботи, розміщені нами на Сайті або стосовно Сайту, становлять повну угоду та взаєморозуміння між вами та нами. Наша нездатність скористатися або забезпечити виконання будь-якого права чи положення цих Умов надання послуг не є відмовою від такого права чи положення. Ці Умови надання послуг діють у повному обсязі, дозволеному законом. Ми можемо будь-коли переуступати будь-які або всі наші права та обов&#39;язки іншим особам. Ми не несемо відповідальності за будь-які втрати, пошкодження, затримки або бездіяльність, спричинені будь-якою причиною, що знаходиться поза нашим розумним контролем. Якщо будь-яке положення або частина положення цих Умов надання послуг буде визнано незаконним, недійсним або таким, що не підлягає виконанню, це положення або частина положення вважається відокремленим від цих Умов надання послуг і не впливає на дійсність та можливість виконання будь-яких інших положень. Між вами та нами не виникають спільні підприємства, партнерські, трудові чи агентські відносини в результаті використання цих Умов надання послуг. Ви погоджуєтеся з тим, що ці Умови надання послуг не будуть тлумачитися проти нас на підставі їх складання. Цим Ви відмовляєтеся від будь-яких заперечень, які Ви можете мати, виходячи з електронної форми цих Умов обслуговування та відсутності підписання сторонами цих Умов обслуговування.",
    contactUsContent1:
      "Якщо у вас є питання щодо будь-яких Умов обслуговування, будь ласка",
    contactUsContent2: "."
  }
};

export default defineI18nLocale(async (locale) => {
  return message;
});

export { message };
